{
    "records": [
      {
        "topic": "Foreword",
        "subtopic": null,
        "subsubtopic": null,
        "content": "ISO (the International Organization for Standardization) is a worldwide federation of national standards bodies (ISO member bodies). The work of preparing International Standards is normally carried out through ISO technical committees. Each member body interested in a subject for which a technical committee has been established has the right to be represented on that committee. International organizations, governmental and non-governmental, in liaison with ISO, also take part in the work. ISO collaborates closely with the International Electrotechnical Commission (IEC) on all matters of electrotechnical standardization.\nThe procedures used to develop this document and those intended for its further maintenance are described in the ISO/IEC Directives, Part 1. In particular, the different approval criteria needed for the different types of ISO documents should be noted. This document was drafted in accordance with the editorial rules of the ISO/IEC Directives, Part 2 (see www.iso.org/directives).\nAttention is drawn to the possibility that some of the elements of this document may be the subject of patent rights. ISO shall not be held responsible for identifying any or all such patent rights. Details of any patent rights identified during the development of the document will be in the Introduction and/or on the ISO list of patent declarations received (see www.iso.org/patents).\nAny trade name used in this document is information given for the convenience of users and does not constitute an endorsement.\nFor an explanation of the voluntary nature of standards, the meaning of ISO specific terms and expressions related to conformity assessment, as well as information about ISO's adherence to the World Trade Organization (WTO) principles in the Technical Barriers to Trade (TBT), see www.iso.org/iso/foreword.html.\nThis document was prepared by Technical Committee ISO/TC 258, Project, programme and portfolio management.\nThis second edition, together with ISO 21502:2020, cancels and replaces the first edition (ISO 21500:2012), which has been technically revised. The main changes compared with the previous edition are as follows:\n— this document provides an overview of the environment for project, programme and portfolio management, their governance, and the general factors impacting the broader environment;\n— this document provides a high-level view of the relationships among the standards on project, programme and portfolio management prepared by ISO/TC 258, while guidance on project management is now given in ISO 21502.\nAny feedback or questions on this document should be directed to the user's national standards body. A complete listing of these bodies can be found at www.iso.org/members.html."
      },
      {
        "topic": "Introduction",
        "subtopic": null,
        "subsubtopic": null,
        "content": "This document provides overarching guidance for the use of the standards on project, programme and portfolio management prepared by ISO/TC 258, and an overview of these disciplines and the related governance in an organization.\nThe audience for this document includes, but is not limited to:\n— practitioners and professionals of project management, programme management and portfolio management;\n— executives, senior management, sponsors and other governing bodies overseeing projects, programmes and portfolios;\n— project, programme and portfolio stakeholders;\n— academia;\n— developers of national standards, organizational standards, industry standards and public policy;\n— users of any of the standards on project, programme and portfolio management prepared by ISO/TC 258."
      },
      {
        "topic": "1 Scope",
        "subtopic": null,
        "subsubtopic": null,
        "content": "This document specifies the organizational context and underlying concepts for undertaking project, programme and portfolio management. It also provides guidance for organizations to adopt or improve project, programme and portfolio management using the standards prepared by ISO/TC 258.\nThis document is applicable to most organizations, including public and private organizations and it is not dependent on the size and type of the organization. It is also applicable to any project, programme and portfolio, regardless of complexity, size or duration.\nFurther guidance on project, programme and portfolio management, and the governance thereof, is given in ISO 21502, ISO 21503, ISO 21504 and ISO 21505."
      },
      {
        "topic": "2 Normative references",
        "subtopic": null,
        "subsubtopic": null,
        "content": "There are no normative references in this document."
      },
      {
        "topic": "3 Terms and definitions",
        "subtopic": null,
        "subsubtopic": null,
        "content": "For the purposes of this document, the following terms and definitions apply.\nISO and IEC maintain terminological databases for use in standardization at the following addresses:\n— ISO Online browsing platform: available at https://www.iso.org/obp;\n— IEC Electropedia: available at http://www.electropedia.org/.\n3.1\nbenefit\ncreated advantage, value or other positive effect\n[SOURCE: ISO/TR 21506:2018, 3.6]\n3.2\nbusiness case\ndocumented justification to support decision making about the commitment to a project (3.15), programme (3.12) or portfolio (3.9)\n[SOURCE: ISO/TR 21506:2018, 3.8]\n3.3\ndeliverable\nunique and verifiable element that is required to be produced by a project (3.15)\n[SOURCE: ISO 21502:2020, 3.9]\n3.4\ngovernance\nprinciples, policies and framework by which an organization is directed and controlled\n[SOURCE: ISO/TR 21506:2018, 3.25]\n3.5\ngoverning body\nperson, group or entity accountable for the governance (3.4) of an organization, organizations or a part of an organization\n[SOURCE: ISO/TR 21506:2018, 3.26]\n3.6\nopportunity\nrisk occurrence that would have a favourable impact\n[SOURCE: ISO/TR 21506:2018, 3.36]\n3.7\noutcome\nchange resulting from the use of the output (3.8) from a project (3.15)\n[SOURCE: ISO 21502:2020, 3.10]\n3.8\noutput\naggregated tangible or intangible deliverables (3.3) that form the project (3.15) result\n[SOURCE: ISO 21502:2020, 3.14]\n3.9\nportfolio\ncollection of portfolio components (3.10) grouped together to facilitate their management to meet strategic objectives\n[SOURCE: ISO/TR 21506:2018, 3.42]\n3.10\nportfolio component\nproject (3.15), programme (3.12), portfolio (3.9) or other related work\n[SOURCE: ISO/TR 21506:2018, 3.43]\n3.11\nportfolio management\ncoordinated activities to direct and control the accomplishment of strategic objectives\n[SOURCE: ISO/TR 21506:2018, 3.45]\n3.12\nprogramme\ngroup of programme components (3.13) managed in a coordinated way to realize benefits (3.1)\n[SOURCE: ISO/TR 21506:2018, 3.50]\n3.13\nprogramme component\nproject (3.15), programme (3.12) or other related work\n[SOURCE: ISO/TR 21506:2018, 3.52]\n3.14\nprogramme management\ncoordinated activities to direct and control the realisation of identified benefits (3.1) and deliverables (3.3)\n[SOURCE: ISO/TR 21506:2018, 3.54]\n3.15\nproject\ntemporary endeavour to achieve one or more defined objectives\n[SOURCE: ISO 21502:2020, 3.20]\n3.16\nproject management\ncoordinated activities to direct and control the accomplishment of agreed objectives\n[SOURCE: ISO 21502:2020, 3.24]\n3.17\nsponsor\nperson responsible for obtaining the resources and executive decisions to enable success\n[SOURCE: ISO/TR 21506:2018, 3.78]\n3.18\nstakeholder\nperson, group or organization that has interests in, or can affect, be affected by, or perceive itself to be affected by, any aspect of the project (3.15), programme (3.12) or portfolio (3.9)\n[SOURCE: ISO/TR 21506:2018, 3.79]\n3.19\nthreat\nrisk occurrence that would have a negative impact\n[SOURCE: ISO/TR 21506:2018, 3.83]"
      },
      {
        "topic": "4 Project, programme and portfolio management concepts",
        "subtopic": "4.1 General",
        "subsubtopic": null,
        "content": "This clause describes the overall context in which governance and management of projects, programmes and portfolios operate. In addition to ongoing operations, project, programme and portfolio management provide an integrated management framework to deliver value. Projects, programmes and portfolios exist within the organizational environment and the organization exists within the larger external environment.\nFigure 1 illustrates that opportunities and threats can be identified through organizational strategy and objectives. The opportunities and threats can be evaluated and further developed into requirements and business cases. Based on those business cases and using portfolio management or another management structure, the organization selects and authorizes projects and programmes that provide deliverables, outputs and outcomes to operations. When used in operations, deliverables, outputs and outcomes should contribute to realizing benefits for internal and external stakeholders. The benefits can also contribute to further development of the organization's strategy and objectives."
      },
      {
        "topic": "4 Project, programme and portfolio management concepts",
        "subtopic": "4.2 Projects, programmes and portfolios",
        "subsubtopic": null,
        "content": "Organizations perform work to achieve objectives. This work can be performed as ongoing operations, a project or a programme, or can be organized as a portfolio together with other related work. An example of the relationship among projects, programmes and portfolios is shown in Figure 2. The focus of each of these organizational activities can be summarized as follows.\n— Operations are conducted by relatively stable teams through ongoing and repetitive processes and are focused on sustaining the organization.\n— Projects are performed by temporary teams and provide deliverables, outputs, outcomes and benefits. A project can be managed as a stand-alone work effort within an organization or as part of a larger programme or portfolio.\n— Programmes are groups of programme components managed in a coordinated way to provide advantages and synergies, contribute to the achievement of common strategic and operational objectives, and realize benefits.\n— Portfolios are the sets of projects, programmes and other related work undertaken to contribute to meeting an organization's strategic objectives."
      },
      {
        "topic": "4 Project, programme and portfolio management concepts",
        "subtopic": "4.3 Organizational environment",
        "subsubtopic": null,
        "content": "The organizational environment is affected by both internal and external factors influencing organizational activities and decision-making. An organization should consider internal influences regarding the governance and management of projects, programmes and portfolios. The internal environment consists of internal stakeholders and is influenced by the structure, culture and processes of the organization. Internal stakeholders include, but are not limited to:\n— members of the governing body;\n— managers in their role as resource owners or in other operational or functional roles;\n— sponsors;\n— project, programme and portfolio managers;\n— employees of the organization impacted by the project, programme or portfolio.\nThe structure and culture of the organization will affect the way it makes decisions, communicates and empowers internal stakeholders and others involved in project, programme and portfolio management. The project, programme and portfolio governance reflects the structure and culture of the organizational governance and should empower internal stakeholders and provide support to manage engagement and expectations of internal stakeholders."
      },
      {
        "topic": "4 Project, programme and portfolio management concepts",
        "subtopic": "4.4 External environment",
        "subsubtopic": null,
        "content": "The external environment of the organization using project, programme and portfolio management affects the organization's ability to realize benefits. Factors to be considered in the external environment include, but are not limited to:\n— opportunities and threats arising from economic, political, social, technological, legal and environmental constraints;\n— expectations and requirements from government or public authorities, clients, suppliers, contractors, other business partners and the public;\n— benefits realization from deliverables, outputs and outcomes produced by the projects and programmes for external stakeholders;\n— projects involving multiple organizations as a means to collaborate with parts of the external environment."
      },
      {
        "topic": "4 Project, programme and portfolio management concepts",
        "subtopic": "4.5 Strategy implementation",
        "subsubtopic": null,
        "content": "Organizations can establish a strategy based on their mission, vision and internal and external environmental factors. The work of accomplishing the strategy and its objectives is referred to as strategy implementation. The strategic objectives of the organization can be achieved through implementation of projects, programmes and operational activities or various combinations of these. Figure 3 depicts the achievement of strategy and objectives through a portfolio of projects and programmes.\nStrategic objectives should guide the identification of potential projects and programmes, which can be collected into one or more portfolios (see ISO 21504). Factors to be considered when selecting projects and programmes, include, but are not limited to:\n— costs versus benefits;\n— types of benefits;\n— acceptable level of risk and risk exposure;\n— alignment to strategic objectives;\n— resource availability;\n— timing of costs and benefit realization.\nThe organization can use portfolio management to:\n— plan for the allocation of resources and the timing of benefits realization;\n— evaluate and mitigate the overall risk exposure;\n— coordinate the timing of projects, programmes and other related work;\n— assist the organization in making active and conscious decisions on selecting, prioritizing and closing projects, programmes and other related work."
      },
      {
        "topic": "4 Project, programme and portfolio management concepts",
        "subtopic": "4.6 Integrated governance and management approaches",
        "subsubtopic": null,
        "content": "Underlying concepts should guide the thinking and behaviour for the governance and management of projects, programmes and portfolios. These concepts include, but are not limited to:\n— strategic alignment: projects, programmes and portfolios should be linked to organizational strategy and objectives;\n— continuous justification: continuous business justification should be used to confirm that expected benefits can be realized and risks managed, and should be used to terminate work when business justification is no longer supported;\n— appropriate framework: governance and management frameworks and controls should be proportionate and appropriate to the work being performed, the risks associated with it and the organization's acceptable level of risk;\n— stakeholder engagement and communications: deliverables, outputs and outcomes should meet the agreed needs expressed by the sponsoring organization and should be accepted by stakeholders;\n— clear roles and responsibilities: authority and accountability should be defined and assigned, consistent and traceable across all levels of a project, programme or portfolio;\n— appropriate planning and management: work should be appropriately planned and quality should be actively managed; ways of working should be tailored to maximize the likelihood of success within a project, programme or portfolio environment;\n— continuous improvement: experience and lessons learned should be captured within the organizational knowledge base, which should be shared and used to promote future project, programme or portfolio performance improvement.\nAn integrated governance and management approach for projects, programmes and portfolios, including the foregoing concepts, should contribute to:\n— building a common understanding of the organization's strategies, objectives, plans and roadmaps;\n— developing a focus on the realization of strategic objectives;\n— enabling transparency and alignment of the contributions to strategic objectives;\n— facilitating communication;\n— enabling transparency of resource utilization and the reasons for resource usage;\n— making progress clearer through consistent reporting, decision gates and escalation procedures.\nThe use of project, programme and portfolio management, combined with governance, can provide guidelines, frameworks, processes and tools to create deliverables, outputs and outcomes to realize the intended benefits. Taking an integrated approach can support strategy implementation as shown in Figure 3."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.1 General",
        "subsubtopic": null,
        "content": "The standards on project, programme and portfolio management prepared by ISO/TC 258 consist of this document (the overarching standard) and four core standards (ISO 21502 on project management, ISO 21503 on programme management, ISO 21504 on portfolio management and ISO 21505 on governance), complemented by supporting standards and a vocabulary (see Figure 4). This clause provides an overview of, and guidance for, the use of the project management, programme management, portfolio management and governance standards."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.2 Overview",
        "subsubtopic": "5.2.1 Core standards",
        "content": "ISO 21502, the project management standard, provides guidance on concepts and practices for project management that are important for and have an impact on a project's successful delivery.\nISO 21503, the programme management standard, provides guidance to support the setting up and tracking of integrated programme components and the realization of benefits.\nISO 21504, the portfolio management standard, provides guidance on project and programme portfolio management. It addresses the need for a consistent approach to managing strategic alignment of projects, programmes, portfolios and other related work.\nISO 21505, the governance standard, provides guidance regarding improved accountability and transparency, and regarding authorizing, directing, empowering, overseeing and limiting the management of projects, programmes and portfolios."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.2 Overview",
        "subsubtopic": "5.2.2 Supporting standards and vocabulary",
        "content": "Supporting standards provide guidance on using various project, programme and portfolio management practices.\nEXAMPLE ISO 21508 and ISO 21511.\nA supporting standard can be applied to project or programme management within an organization, as required within the governance structure of that organization.\nISO/TR 21506 defines terms used in project, programme and portfolio management and related governance."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.3 Benefits of using standards on project, programme and portfolio management",
        "subsubtopic": "5.3.1 General",
        "content": "Although there are many ways to implement project, programme and portfolio management and related governance, the use of the standards prepared by ISO/TC 258 provides a structured approach that can contribute to increasing benefits. This subclause describes the specific benefits of using ISO 21502, ISO 21503, ISO 21504 and ISO 21505. General benefits of using them include, but are not limited to, providing a common and internationally recognized frame of reference for concepts, guidelines, frameworks and processes regarding the application of project, programme and portfolio management, and related governance."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.3 Benefits of using standards on project, programme and portfolio management",
        "subsubtopic": "5.3.2 Project management",
        "content": "The benefits of using ISO 21502 include, but are not limited to:\n— advancing opportunities to transform ideas into tangible and intangible deliverables, outputs, outcomes and benefits;\n— enhancing organizational strength through project implementation;\n— enabling the integrated management of planning, benefits, scope, resources, schedule, cost, risk, issues, change control, quality, stakeholder engagement, communication, organizational and societal change, reporting, information and documentation, procurement, lessons learned and other project management practices."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.3 Benefits of using standards on project, programme and portfolio management",
        "subsubtopic": "5.3.3 Programme management",
        "content": "The benefits of using ISO 21503 include, but are not limited to:\n— initiating and coordinating projects to contribute to a desired outcome;\n— maintaining consistent oversight of the projects that together contribute to the desired outcome;\n— promoting management practices for the integrated management of related projects or other programme components;\n— strengthening strategic advantage and enabling sustainable change;\n— developing alignment between strategy and results through benefits management;\n— enhancing stakeholder engagement through the coordinated implementation of related projects, programmes and other related work;\n— enabling the realization of organizational value."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.3 Benefits of using standards on project, programme and portfolio management",
        "subsubtopic": "5.3.4 Portfolio management",
        "content": "The benefits of using ISO 21504 include, but are not limited to:\n— selecting projects and programmes to contribute to the agreed organizational strategy and objectives;\n— maintaining consistent oversight of the projects and programmes that together contribute to achieving the agreed strategy and objectives;\n— developing a systematic methodology to select and prioritize the projects, programmes and portfolios among competing opportunities;\n— establishing and aligning projects, programmes and portfolios with the organization's strategic objectives;\n— enabling alignment among organizational governance and project and programme management;\n— improving alignment of strategy and deliverables, outputs and outcomes through value and benefits management."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.3 Benefits of using standards on project, programme and portfolio management",
        "subsubtopic": "5.3.5 Governance",
        "content": "The benefits of using ISO 21505 include, but are not limited to:\n— clarifying accountability;\n— establishing transparency;\n— improving engagement with internal and external stakeholders;\n— managing organizational risk exposure;\n— clarifying organizational values, ethics and processes."
      },
      {
        "topic": "5 Standards on project, programme and portfolio management",
        "subtopic": "5.4 Organizational considerations for selection",
        "subsubtopic": null,
        "content": "Selecting which standard(s) to apply to a specific organization can be dependent on several considerations, including but not limited to:\n— the strategic objectives to be achieved;\n— the range of options for achieving the strategic objectives and the range of projects and programmes that support these objectives;\n— a need for integration among two or more projects, programmes and other related work, both internal and external to the organization;\n— the project environment that exists internally and externally to the organization;\n— the governance structure of the organization;\n— management approaches;\n— the organizational culture and values;\n— resource considerations;\n— contractual relationships.\nThe analysis of these items and other considerations unique to the organization should be the basis for selecting the applicable standards and implementing them within the organization. ISO 21502, ISO 21503 and ISO 21504 contain prerequisites for the practice of project management, programme management and portfolio management to assist with selection and use of the standards.\nOnce an organization has determined the standard(s) to be used, it should refer to the governance standard, ISO 21505, for implementing the framework for the processes, procedures and practices, enabling the governance of projects, programmes and portfolios as an integrated part of the organization's overall governance."
      },
      {
        "topic": "Bibliography",
        "subtopic": null,
        "subsubtopic": null,
        "content": "[1] ISO 21502, Project, programme and portfolio management — Guidance on project management\n[2] ISO 21503, Project, programme and portfolio management — Guidance on programme management\n[3] ISO 21504, Project, programme and portfolio management — Guidance on portfolio management\n[4] ISO 21505, Project, programme and portfolio management — Guidance on governance\n[5] ISO/TR 21506, Project, programme and portfolio management — Vocabulary\n[6] ISO 21508, Earned value management in project and programme management\n[7] ISO 21511, Work breakdown structures for project and programme management"
      }
    ]
  }