
{
  "records": [
    {
      "topic": "1 Scope",
      "subtopic": null,
      "subsubtopic": null,
      "content": "This document gives guidelines for project management. It is applicable to any organization, including public, private and charitable, as well as to any type of project, regardless of purpose, delivery approaches, life cycle model used, complexity, size, cost or duration.\nNOTE Delivery approach can be any method or process suited to the type of outputs, such as predictive, incremental, iterative, adaptive or hybrid, including agile approaches.\nThis document provides high-level descriptions of practices that are considered to work well and produce good results within the context of project management. This document does not provide guidance on the management of programmes or portfolios. Topics relating to general management are addressed only within the context of project management."
    },
    {
      "topic": "2 Normative references",
      "subtopic": null,
      "subsubtopic": null,
      "content": "There are no normative references in this document."
    },
    {
      "topic": "3 Terms and definitions",
      "subtopic": null,
      "subsubtopic": null,
      "content": "For the purposes of this document, the following terms and definitions apply.\nISO and IEC maintain terminological databases for use in standardization at the following addresses:\n— ISO Online browsing platform: available at https://www.iso.org/obp\n— IEC Electropedia: available at http://www.electropedia.org/\n3.1\nbaseline\nreference basis for comparison against which performance is monitored and controlled\n[SOURCE: ISO/TR 21506:2018, 3.5]\n3.2\nbenefit\ncreated advantage, value or other positive effect\n[SOURCE: ISO/TR 21506:2018, 3.6]\n3.3\nbusiness case\ndocumented justification to support decision making about the commitment to a project (3.20), programme (3.18) or portfolio (3.15)\n[SOURCE: ISO/TR 21506:2018, 3.8]\n3.4\nchange request\ndocumentation that defines a proposed alteration to a project (3.20)\n[SOURCE: ISO/TR 21506:2018, 3.10]\n3.5\nconfiguration management\napplication of procedures to control (3.6), correlate and maintain documentation, specifications and physical attributes\n[SOURCE: ISO/TR 21506:2018, 3.12]\n3.6\ncontrol\ncomparison of actual performance with planned performance, analysing variances and taking appropriate corrective and preventive action (3.17) as needed\n[SOURCE: ISO/TR 21506:2018, 3.13]\n3.7\ncorrective action\ndirection and activity for modifying the performance of work to bring performance in line with a plan\n[SOURCE: ISO/TR 21506:2018, 3.15]\n3.8\ncritical path\nsequence of activities that determine the earliest possible completion date for a project (3.20) or phase\n[SOURCE: ISO/TR 21506:2018, 3.18]\n3.9\ndeliverable\nunique and verifiable element that is required to be produced by a project (3.20)\n[SOURCE: ISO/TR 21506:2018, 3.19, modified — The words “tangible or intangible outcome of a planned activity” have been replaced by “element that is required to be produced by a project”.]\n3.10\ngovernance\nprinciples, policies and framework by which an organization is directed and controlled\n[SOURCE: ISO/TR 21506:2018, 3.25]\n3.11\nissue\nevent that arises during a project (3.20) requiring resolution for the project to proceed\n3.12\nopportunity\nrisk occurrence that would have a favourable impact\n[SOURCE: ISO/TR 21506:2018, 3.36]\n3.13\noutcome\nchange resulting from the use of the output (3.14) from a project (3.20)\n3.14\noutput\naggregated tangible or intangible deliverables (3.9) that form the project (3.20) result\n3.15\nportfolio\ncollection of portfolio components (3.16) grouped together to facilitate their management to meet strategic objectives\n[SOURCE: ISO/TR 21506:2018, 3.42]\n3.16\nportfolio component\nproject (3.20), programme (3.18), portfolio (3.15) or other related work\n[SOURCE: ISO/TR 21506:2018, 3.43]\n3.17\npreventive action\naction to eliminate the cause of a potential nonconformity or other potential undesirable situation\nNote 1 to entry: Preventive action is taken to prevent occurrence whereas corrective action (3.7) is taken to prevent recurrence.\n[SOURCE: ISO 9000:2015, 3.12.1, modified — The original Note 1 to entry has been deleted.]\n3.18\nprogramme\ngroup of programme components (3.19) managed in a coordinated way to realize benefits (3.2)\n[SOURCE: ISO/TR 21506:2018, 3.50]\n3.19\nprogramme component\nproject (3.20), programme (3.18) or other related work\n[SOURCE: ISO/TR 21506:2018, 3.52]\n3.20\nproject\ntemporary endeavour to achieve one or more defined objectives\n[SOURCE: ISO/TR 21506:2018, 3.59, modified — The words “created to produce agreed deliverables” have been replaced by “to achieve one or more defined objectives”.]\n3.21\nproject assurance\nplanned and systematic actions necessary to provide confidence to the sponsoring organization and project sponsor (3.26) that a project (3.20) is likely to achieve its objectives\n3.22\nproject governance\nprinciples, policies and procedures by which a project (3.20) is authorized and directed to accomplish agreed objectives\n[SOURCE: ISO/TR 21506:2018, 3.60]\n3.23\nproject life cycle\ndefined set of phases from the start to the end of a project (3.20)\n3.24\nproject management\ncoordinated activities to direct and control (3.6) the accomplishment of agreed objectives\n[SOURCE: ISO/TR 21506:2018, 3.61, modified — The word “deliverables” has been replaced by “objectives”.]\n3.25\nproject scope\nauthorized work to accomplish agreed objectives\n[SOURCE: ISO/TR 21506:2018, 3.65, modified — The word “deliverables” has been replaced by “objectives”.]\n3.26\nsponsor\nperson responsible for obtaining the resources and executive decisions to enable success\n[SOURCE: ISO/TR 21506:2018, 3.78]\n3.27\nstakeholder\nperson, group or organization that has interests in, or can affect, be affected by, or perceive itself to be affected by, any aspect of a project (3.20), programme (3.18) or portfolio (3.15)\n[SOURCE: ISO/TR 21506:2018, 3.79]\n3.28\nthreat\nrisk occurrence that would have a negative impact\n[SOURCE: ISO/TR 21506:2018, 3.83]\n3.29\nwork breakdown structure\ndecomposition of the defined scope of a project (3.20) or programme (3.18) into progressively lower levels consisting of elements of work\n[SOURCE: ISO/TR 21506:2018, 3.87]\n3.30\nwork package\ngroup of activities that have a defined scope, deliverable (3.9), timescale and cost"
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.1 Overview",
      "subsubtopic": "4.1.1 General",
      "content": "Clause 4 describes the concepts relating to project management which are drawn on when undertaking the practices described in Clauses 6 and 7. Figure 1 illustrates a context and environment within which a project can exist. A project can be stand-alone or part of a programme or portfolio (see 4.2.5), and can cross boundaries within an organization and between organizations. The organizational strategy should be used to identify, document and evaluate opportunities threats, weaknesses and strengths, which can help inform future action. Selected opportunities and threats can be further examined and justified in a business case. A business case can result in one or more projects being initiated. The outputs from projects are expected to deliver outcomes, which should realize benefits for the sponsoring organizations, as well as for internal or external stakeholders."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.1 Overview",
      "subsubtopic": "4.1.2 Projects",
      "content": "Organizations undertake work to achieve specific objectives. Generally, this work can be categorized as either operations or projects. Operations and projects differ in that:\na) projects are temporary and focus on retaining or adding value or capability, for a sponsoring organization, stakeholder or customer;\nb) operations are performed through ongoing activities and can be focused on sustaining the organization, such as through the delivery of repeatable products and services.\nA project's objective can be fulfilled by a combination of deliverables, outputs, outcomes and benefits, depending on the project's context (see 4.2) and direction provided through governance (see 4.3). A project's objective should contribute to outcomes and realization of benefits for stakeholders, including the sponsoring organization, other internal and external organization stakeholders, customers and their stakeholders. Although many projects have similar features, each project is unique. Differences among projects can occur in factors such as, but not limited to:\n— objectives;\n— context;\n— outcomes desired;\n— outputs provided;\n— stakeholders impacted;\n— resources used;\n— complexity;\n— constraints (see 4.2.4);\n— processes or methods used."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.1 Overview",
      "subsubtopic": "4.1.3 Project management",
      "content": "Project management integrates the practices included in this document to direct, initiate, plan, monitor, control and close the project, manage the resources assigned to the project and motivate those individuals involved in the project to achieve the project's objectives. Project management should be performed through a set of processes and methods that should be designed as a system and should include practices necessary for a specific project as described in this document."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.2 Context",
      "subsubtopic": "4.2.1 Impact of a project's context",
      "content": "4.2.1.1 General\nThe context of a project can impact a project's performance and likelihood of success. The project team should consider factors both within and outside the organization.\n4.2.1.2 Factors within the organization\nFactors within the organization, such as strategy, technology, general and project management maturity, resource availability, and organizational culture and structure, can have an impact on a project's success. A relationship exists between a project and its context that should be considered when tailoring the project management approach, developing the business case, conducting feasibility studies and designing for the transition to operations and customers, where applicable.\n4.2.1.3 Factors outside the organization\nFactors outside the organization can include, but are not limited to, socio-economic, geographical, political, regulatory, technological and ecological factors. These factors can have an impact on the project by imposing requirements or constraints or by introducing risks that affect the project. Although these factors are often beyond the power or capability of the project sponsor or project manager to control or influence, these factors should still be considered and planned for when directing, justifying (see 4.3.2), initiating, planning, monitoring, controlling and closing the project."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.2 Context",
      "subsubtopic": "4.2.2 Organizational strategy and projects",
      "content": "Organizations often establish their overall strategy based on their vision, mission, values, policies and factors internal and external to the organization. Projects can be a means to achieving strategic objectives. Potential outputs and outcomes should be considered when identifying organizational opportunities and threats. The creation of value from undertaking projects is illustrated in Figure 2. Positive value is created when the benefits enabled by the project exceed the investment of resources. The created value can be tangible or intangible."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.2 Context",
      "subsubtopic": "4.2.3 Customer and supplier perspective",
      "content": "Projects can be undertaken from two perspectives:\na) customer or sponsoring organization: the organization owns the requirements and can either undertake the work or contract some or all the work to a supplier organization;\nb) supplier or contractor organization: the organization provides, as a core basis or part of their business, a service or product to other organizations.\nEXAMPLE 1 Examples of a service or product delivered by a supplier or contractor, as a project for revenue, can include the construction of roads, airports, railways and information technology systems.\nIn most cases, the supplier's project scope is a portion of the customer's project scope. Each party to a contract should look after its organizational interests in the project and have its justification for undertaking the project. The customer-supplier relationship can be confusing as, for some projects, this relationship can be both inter-organizational and intra-organizational. In such cases, the supplier's role is carried out in part by an outside contractor or supplier for a customer that is from another department or section within the same organization.\nEXAMPLE 2 An organization's information technology department can undertake a software upgrade using contracted resources or partners for the manufacturing department. In these situations, supplier-customer roles can be multidimensional.\nThe parties to the contract should determine:\n— how project governance (see 4.3) should operate on both sides of, and across, a contractual boundary;\n— the structure of the organization's project management team (see 4.5.1);\n— the appropriate people to be involved in the project;\n— working practices to be adopted in relation to the project life cycle, as necessary for delivery."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.2 Context",
      "subsubtopic": "4.2.4 Project constraints",
      "content": "The outputs and outcomes of the project should be achieved within an identified set of constraints, such as, but not limited to:\na) the duration or target date for completing the project;\nb) the availability of organizational funding;\nc) the approved and allocated budget;\nd) the availability of the project resources, such as people with appropriate skills, facilities, equipment, materials, infrastructure, tools and other resources required to carry out the project's activities related to the requirements of the project;\ne) factors related to the health and safety of personnel;\nf) security;\ng) an acceptable level of risk;\nh) the potential social, environmental and ecological impact of the project and its outputs;\ni) laws, rules and other governmental requirements;\nj) minimum quality standards.\nConstraints are often interrelated, such that a change in one constraint can affect one or more of the other constraints. For this reason, the effect of these constraints should be understood, balanced and periodically reviewed.\nAgreement should be sought among the project's key stakeholders, especially decision-makers, on the project's constraints and their relative priority to form a solid foundation for decisions and subsequent actions intended to foster success."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.2 Context",
      "subsubtopic": "4.2.5 Projects as stand-alone, part of a programme or part of a portfolio",
      "content": "Projects can be organized as components of programmes or portfolios or can be stand-alone (see ISO 21503 and ISO 21504). See Figure 3 for examples of how projects relate to other components.\nThe fundamentals of project management are the same in all situations, but a typical difference is how the project governance works, in particular the level of reporting and decision-making. If a project is part of a programme or portfolio, its objectives and governance should be aligned with the governance of that programme or portfolio (see 4.3)."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.3 Project governance",
      "subsubtopic": "4.3.1 Governance framework",
      "content": "Project governance should include the principles, policies and frameworks by which an organization directs, authorizes and controls the project based on an agreed business case. Governance should provide oversight on subjects, such as:\na) policies, processes and methods to be used to undertake the activities and practices defined in this document;\nb) management frameworks, including a project life cycle (see 4.4);\nc) roles and responsibilities, including limits of authority for decision-making (see 4.5).\nThe responsibility for maintaining project governance is usually assigned by the governing body of the sponsoring organization to the project sponsor (see 4.5.4) or project board (see 4.5.3).\nProject governance should be an integrated part of the sponsoring organization's overall governance framework."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.3 Project governance",
      "subsubtopic": "4.3.2 Business case",
      "content": "The business case provides a foundation for project governance. A business case should be used to justify the undertaking and continuation of a project and should as a minimum include or reference:\na) objectives to be achieved;\nb) strategic alignment and potential benefits to be realized;\nc) defined metrics to evaluate the value being created;\nd) the organization's acceptable level of risk;\ne) budget, schedule and quality requirements;\nf) potential business and disruption to other organizational operations;\ng) stakeholder engagement and relationship management;\nh) human and material resource use;\ni) skills, knowledge and capabilities required;\nj) targeted scope;\nk) presentation of scenarios;\nl) proposed management approach;\nm) ability to sustain business and organizational activities through change."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.4 Project life cycle",
      "subsubtopic": null,
      "content": "The following should be considered when defining a project's life cycle:\na) organizational and project governance;\nb) risks;\nc) control factors;\nd) the nature or characteristics of the project;\ne) other organizational and environmental factors.\nThe number and names of a project's phases depend upon the type of project being undertaken, desired governance, and the anticipated risk. The phases can reflect the delivery approach being taken, such as predictive, iterative, incremental, adaptive or a hybrid of approaches. Management methods often use different words to denote phases, such as “stage”, “iteration” and “release”.\nThe phases should have a defined start and end. Each phase of the project life cycle should have specific milestones that relate to the decisions, key deliverables, outputs or outcomes. Each phase should be preceded by a decision point. These decision points, often referred to as “gates”, are essential aspects of project governance. The criteria to be met to authorize the start of a phase should be defined but can vary depending on the organizational environment, the specific life cycle being used and the established project governance. In some cases, phases can overlap.\nThe decision points and phases, as illustrated in Figure 4, should be defined and can vary depending on the organizational and external environments, funding, benefits required, risk and constraints. Figure 4 further illustrates the linkages between the project life cycle, integrated project management practices (see Clause 6) and the management practices for a project (see Clause 7).\nNOTE 1 In some cases, phases can overlap.\nNOTE 2 Phases are sometimes referred to as \"stages\"."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.1 Project organization",
      "content": "The project organization is a temporary structure that defines roles, responsibilities and authorities in the project. Individuals are assigned by names to specific roles in the project organization. The project organization should:\na) specify clear reporting lines;\nb) be approved by the project sponsor or project board;\nc) be communicated to everyone involved in the project.\nDesign of the project organization can be dependent on the project's context (see 4.2), the organizational environment (see 4.4) and the stakeholders (see 4.5.10).\nThe project organization should be defined in sufficient detail for each individual to understand their role and responsibilities, and the roles and responsibilities of those individuals with whom they work. Responsibilities should be mutually consistent and traceable throughout the project. The design and implementation of project organizations should also consider the informal aspects of project management, such as the culture of the organization and motivation and co-ordination of project team members, as well as levels of interpersonal skills and behaviours.\nAn example structure of the project organization is shown in Figure 5. Relationships among roles within the project organization should be defined and can be managed as described in 7.5.\nNOTE 1 When a project board exists, the reporting line can change to suit governance arrangements.\nNOTE 2 A project office does not always exist in all organizations.\nAn individual may fulfil more than one role, but the individual undertaking the project sponsor role should not also undertake the project manager, work package leader or project team member roles, due to the possibility of conflicting interests.\nThe project organization can also include the customers or customer representatives, as well as the suppliers or contractors, as described in 4.2.3. The project organization can change throughout the project life cycle, especially between phases, according to specific works to be accomplished and competencies needed.\nRoles and responsibilities of the project organization are detailed in 4.5.2 to 4.5.11."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.2 Sponsoring organization",
      "content": "The sponsoring organization acts as a higher-level authority and should provide direction and resources to the project board or the project sponsor, address escalated risk and issues and make or refer decisions that are above the delegated authority of the project board or the project sponsor. The project sponsor can represent the sponsoring organization and therefore may not have a higher-level authority to whom to escalate risks and issues, or from whom to seek direction. The representative of the sponsoring organization, the actual person or body undertaking this role depends on the project's context. For example:\na) for a project within a portfolio, the higher-level authority can be the portfolio manager or director;\nb) for a project within a programme, the higher-level authority can be the programme manager.\nNOTE For the integrated project management practices associated with the sponsoring organization, see 6.2, 6.3 and 6.9."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.3 Project board",
      "content": "The project board, if needed, should contribute to the project by providing direction and guidance to the project sponsor (see Figure 5). The role of a project board can differ from organization to organization and project to project, in regard to its authority relative to the project sponsor. For example, a project board can include:\na) either a governance body, representing the higher-level authority to which the project sponsor is accountable;\nb) or a board, chaired by the project sponsor, which provides the sponsor with senior-level advice.\nThe project board should:\n— monitor the project's progress and outlook to confirm that the interests of the organization are being served;\n— provide a forum for assisting with strategic decisions and removing obstacles, and for resolving issues.\nIf a project is a joint undertaking among two or more organizations, a project board can include representatives from each organization (see ISO 21505).\nNOTE Commonly used terms for project boards include, but are not limited to, \"project steering group”, \"project steering board”, “project steering committee” or “governance committee\"."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.4 Project sponsor",
      "content": "The project sponsor is accountable to a defined higher-level authority for achieving the project's objectives, delivering the required outputs and outcomes, and realizing the required benefits.\nThe project sponsor should own or champion the business case, and should be accountable for project governance, including audits, reviews and assurance (see ISO 21505). Additionally, the project sponsor's responsibilities should include, but are not limited to:\na) validating that the project is justified throughout its life cycle;\nb) confirming that the project manager and team are skilled and competent to carry out the assigned work;\nc) providing the project manager with decisions, direction, advice and context to enable the stated business need defined in the business case to be met within the project's or organization's acceptable level of risk;\nd) confirming that the organization is prepared for and is committed to the organizational or societal change and that the change occurs (see 7.14);\ne) addressing escalated issues and risks;\nf) engaging key stakeholders;\ng) making decisions within their delegated authority;\nh) escalating risks and issues beyond their delegated authority to the higher-level authority;\ni) setting the cultural and ethical tone for the project.\nA project sponsor is often a member of the project board and represents the project board's interests and positions on routine or pre-agreed project management activities. In some circumstances, individuals can support the project sponsor or can act on behalf of the project sponsor for a defined set of responsibilities. In such cases, the division of responsibilities should be defined in the project organization.\nNOTE 1 Commonly used terms for project sponsor include \"project executive\", \"project owner\", \"product owner representative\" and \"senior responsible owner\" (see Figure 5).\nNOTE 2 For the integrated project management practices associated with a project sponsor, see 6.4."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.5 Project assurance",
      "content": "While the project sponsor is accountable for audits, reviews and assurance (see 4.5.4), these activities may be assigned to one or more persons who are independent of the project manager and team, and who act on behalf of the project sponsor."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.6 Project manager",
      "content": "The project manager is accountable to the project sponsor or project board for completing the project's defined scope, and for leading and managing the project team. The project manager's other activities may include, but are not limited to:\na) establishing the management approach in alignment with the agreed governance approach;\nb) motivating the project team;\nc) providing day-to-day supervision and leadership;\nd) defining the approach, responsibilities, scope of work and targets for the team;\ne) monitoring, forecasting and reporting overall progress against the project plan (see 7.2 and 7.15);\nf) managing risks (see 7.8) and issues (see 7.9);\ng) controlling and managing project changes (see 7.10);\nh) managing supplier performance as defined in relevant contracts (see 7.17);\ni) ensuring stakeholder engagement (see 7.12) and communication (see 7.13) takes place as planned;\nj) validating the deliverables and outcomes provided by the project.\nThe project manager can be assisted by a project management team, with members undertaking specific roles, such as scheduling, cost control and quality assurance.\nNOTE For the integrated project management practices associated with a project manager, see 6.5, 6.6 and 6.8."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.7 Project office",
      "content": "A project office, if required, should have its role, responsibilities and reporting line defined. Project offices can perform a wide variety of activities supporting the project manager and team, including, but not limited to:\na) analysis;\nb) defining and administering governance;\nc) standardizing project methods and processes;\nd) project management training;\ne) planning and monitoring;\nf) information management;\ng) providing administrative support.\nIn addition, a project office can support several projects, be combined with a programme or portfolio management office, or perform functions as the programme or portfolio management office.\nProject offices can support roles other than the project manager, such as the project sponsor, project board or other positions within the project team. A project office can support organizations in improving their project management maturity, acting in the role of competence centre or centre of excellence of project management.\nNOTE A project office can be referred to as a \"project management office\", a \"project support office\" or another organizationally approved term."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.8 Work package leader",
      "content": "A work package leader is accountable to the project manager for leading, managing and delivering the assigned outputs or outcomes, as defined in a work package. The work package leader or team leader can be part of the sponsoring organization or from a third-party organization, such as a contractor. The work package leader's responsibilities include, but are not limited to:\na) confirming work packages are completed to the required quality, on schedule and on budget;\nb) contributing to and reviewing significant management documentation;\nc) planning, monitoring, forecasting and reporting overall progress against the work package plan;\nd) managing the resolution of risks and issues, and escalating any that exceed the level of decision authority;\ne) controlling changes to the work scope and requesting authorization for those changes that are outside their authority;\nf) managing and optimizing the use of resources;\ng) handing over final outputs to the project team or project manager.\nNOTE 1 The project manager can assume the role of a work package leader.\nNOTE 2 For the integrated project management practices associated with a work package leader, see 6.7."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.9 Project team members",
      "content": "The project team members perform project activities and are accountable to a work package leader or the project manager for the completion of their assigned activities and the resulting deliverables."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.10 Project stakeholders",
      "content": "Project stakeholders are persons, groups or organizations that have interests in, can affect, be affected by, or perceive themselves to be affected by any aspect of the project (see Figure 6). Project stakeholders can be internal or external to the project and the organization."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.5 Project organization and roles",
      "subsubtopic": "4.5.11 Other roles",
      "content": "Other roles should be defined to suit the needs of the work required, such as for those managing the development of outputs. Examples include roles relating to agile delivery, service and operations management, organizational and societal change, communications and various engineering disciplines."
    },
    {
      "topic": "4 Project management concepts",
      "subtopic": "4.6 Competencies of project personnel",
      "subsubtopic": null,
      "content": "Project management competencies can be categorized into, but are not limited to:\na) technical competencies, for directing, managing, planning and delivering a project in a structured way, including the concepts and practices defined in this document;\nb) behavioural competencies, associated with personal relationships, such as but not limited to, leadership, team building, people management, coaching, negotiation and conflict management;\nc) business and other competencies related to the management of the project within the organizational, contractual and external environment.\nProject team members not participating in the management of the project should be competent in a relevant area, enabling them to be capable of performing their assigned roles and responsibilities.\nA gap between the required and available competencies should be considered as either a constraint or risk to the project. A gap should be reviewed and mitigated. Competencies and skills can be improved or increased through continuing personal and professional development."
    },
    {
      "topic": "5 Prerequisites for formalizing project management",
      "subtopic": "5.1 Overview",
      "subsubtopic": null,
      "content": "All organizations carry out project work formally or informally. There are various prerequisites that an organization should consider before establishing an environment for implementing, maintaining and improving project management. This environment is sometimes referred to as the \"project environment\" or the \"project management environment\". The project management environment can vary from one organization to another.\nBefore starting to formalize project management in an organization, the following items should be assessed:\na) the types, size, frequency and complexity of current and future projects;\nb) positive versus negative impact on the organization, including the impacts on the strategic objectives, vision, mission and other organizational considerations;\nc) preparing the organization for the implementation of project management, including human resource requirements and necessary organizational structure, systems and process changes;\nd) impacts on customers and other stakeholders."
    },
    {
      "topic": "5 Prerequisites for formalizing project management",
      "subtopic": "5.2 Considerations for implementing project management",
      "subsubtopic": null,
      "content": "Depending on the scale and complexity of the organizational or societal changes being made, the implementation of formal project management in an organization should be managed as a project, programme or part of a portfolio. When considering the implementation of a formal project management approach, an organization should consider, but not be limited to, the following factors:\na) identified needs for and benefits of formal project management;\nb) ability to integrate and align other related work with strategic and business objectives;\nc) capacity to absorb necessary changes within the organizational governance, structure and culture;\nd) resource capacity of the organization to incorporate the change, including, but not limited to, human resources and budget;\ne) potential impacts on both internal and external stakeholders;\nf) ability to work across organizational boundaries;\ng) availability of required competencies to implement the approach for future projects;\nh) impacts on budgets, identified risks, schedules and requirements of ongoing and planned activities of the organization.\nThe business case justifying the implementation of formal project management should conform to the guidelines provided in 4.3.2."
    },
    {
      "topic": "5 Prerequisites for formalizing project management",
      "subtopic": "5.3 Continuous improvement of the project management environment",
      "subsubtopic": null,
      "content": "Executive and senior management should facilitate an environment and culture of continuous improvement that seeks to verify and sustain the ongoing suitability, adequacy, effectiveness and efficiency of project management within the organization. Activities should be undertaken, when needed, to facilitate continuous improvement and should include, but not be limited to:\na) the establishment of an evaluation process for the organization's project management framework with an emphasis on verifying alignment to the organization's strategy, business and operational objectives, and the extent to which lessons are being learned and implemented;\nb) the evaluation of the effectiveness of the project management framework and governance;\nc) the implementation of identified and agreed improvements;\nd) the determination and prioritization of improvements and adjustments to be implemented;\ne) the collection and implementation of lessons learned for the benefit of current and future projects;\nf) the development of project management skills for staff through education, training and mentoring.\nProject management progress evaluations can also provide information to the organization for the continuous improvement of project management frameworks, methods and techniques, and can be used in conjunction with the framework identified in 5.4.\nA timeline and an approach should be established by senior management, a quality assurance function or a project office (see 4.5.7), for the periodic evaluation, which should:\n— facilitate the continuous development of project management processes, methods and techniques, and provide for regular assessments of project management maturity within the organization;\n— include communication to those affected by any changes as to how project management is to be conducted in the organization.\nProject sponsors, project managers and their teams should be consulted as part of any evaluation."
    },
    {
      "topic": "5 Prerequisites for formalizing project management",
      "subtopic": "5.4 Alignment with organizational processes and systems",
      "subsubtopic": null,
      "content": "The governance framework for projects should be aligned with other organizational processes and systems, including but not limited to:\na) organizational governance;\nb) performance reporting;\nc) applicable procedures and relevant delivery approaches;\nd) risk management;\ne) portfolio and programme management;\nf) investment and financial management;\ng) business analysis, strategic and operational planning;\nh) information and documentation management;\ni) quality management.\nWhen aligning project management practices and systems, the following should also be considered:\n— functional and physical organizational or other prevailing structures;\n— conflicting procedures, processes, plans and systems;\n— communication methods and cycles;\n— technology availability and access;\n— the context of operations of the organization;\n— balancing and optimizing the social, economic and environmental characteristics;\n— administrative and authorization systems;\n— sustainability and oversight requirements."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.1 Overview",
      "subsubtopic": null,
      "content": "Integrated project management practices should cover the practices to be used when undertaking a project from the pre-project activities, which are accomplished leading up to the decision to initiate the project, through the planning and controlling activities to the post-project activities. This clause identifies the recommended project management practices that should be used when undertaking a project, individual phases and other project activities or groups of activities. The practices in this clause draw on the concepts described in Clause 4.\nIntegration and tailoring of selected project management practices, identified in Clause 7, into a cohesive approach for managing project work can be a key to project success. The purpose of these integrated project management practices is to enable the project organization to:\na) achieve the project's objectives;\nb) define and manage the scope of the project within the constraints, while considering the risks and resource needs;\nc) obtain support from each participating and performing organization, including commitment from resource owners, funders, suppliers, customers, users and other stakeholders.\nManaging a project should include an integrated approach that considers items such as the various roles, disciplines, competencies and organizational and environmental factors that influence the project's success. Integrated project management practices should be aligned and connected with other practices, as shown in Figure 4.\nThe project management approach should be tailored and applied considering the organization's needs, level of prevailing risk, the competence of those individuals involved and other project-specific considerations. Tailoring and applying the practices in Clauses 6 and 7 should be undertaken in accordance with the relevant organizational policies. Conflicts between organizational policies and project management practices should be resolved in consultation with the project sponsor.\nThe integrated project management practices are shown in Figure 7 and include the pre- and post-project activities. The relationships among the activities and the associated roles (see 4.5). Subclauses 6.2 to 6.9 describe each practice in detail."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.2 Pre-project activities",
      "subsubtopic": null,
      "content": "The purpose of the pre-project activities is for the sponsoring organization to verify the project is worth starting. The pre-project activities are those activities that should be accomplished leading up to a decision to initiate a project. Identified needs and opportunities, resulting from the organizational strategy or business requirements, should be evaluated to enable senior management, such as organizational management, portfolio management or programme management, to identify potential projects that can transform some or all these needs and opportunities into realized benefits. These needs and opportunities can address, for example, a new market demand, a current organizational need or a new legal requirement. The needs and opportunities should be evaluated (see 4.3.2) before formal authorization to initiate a new project.\nThe project's objectives, benefits, rationale and investment should be justified and documented in sufficient detail to enable a decision to be made on whether to initiate a project. Such documentation can be used to enable the prioritization of needs and opportunities. This prioritization can relate to:\na) some aspect of the organization's strategy or business plan;\nb) higher-level programme or portfolio needs;\nc) customer's needs.\nThe purpose of such justification is to obtain organizational commitment and authorization for investment in the selected project together with an understanding of the constraints, risks and assumptions.\nNOTE The justification for initiating the project can be defined in documents such as terms of reference, a brief, a proposal or a preliminary business case (see 4.3.2).\nAn evaluation should be undertaken to determine if the project should be undertaken at the organization, portfolio or programme level. Such an evaluation should be based on multiple criteria, such as quantitative, qualitative and financial criteria, alignment to organizational strategy, sustainability and social and environmental impact. Criteria are likely to differ among different organizations, portfolios, programmes and projects, depending on the context."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.3 Overseeing a project",
      "subsubtopic": null,
      "content": "The purpose of overseeing a project is for the sponsoring organization to be satisfied that the project team remains able to achieve the project's objectives, the project still meets the organization's needs and stakeholder expectations, and that risks are at an acceptable level.\nThis oversight can be done through:\na) involvement in key decisions;\nb) periodic reporting;\nc) assurance reviews and audits;\nd) ad hoc escalations and interventions.\nWhile many higher-level decisions can be delegated to the project sponsor, it is often more appropriate for higher-level management within the sponsoring organization to retain some decisions. Decisions affected by factors outside the project, such as economy, social and environmental sustainability and availability of funds or resources, can only be made at a higher-level, due to their impact on other projects and work. The sponsoring organization should keep the project sponsor updated on the project's wider context, providing guidance and direction, as needed or when requested. The sponsoring organization should enable the project sponsor to have sufficient time to carry out their responsibilities effectively.\nNOTE See 4.5.2 for the sponsoring organization's role concerning overseeing a project."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.4 Directing a project",
      "subsubtopic": null,
      "content": "The purpose of directing a project is to enable the project to continue to be relevant and justifiable in the organizational context.\nThe project sponsor, supported or overseen by the project board, should confirm that:\na) an organizational need is being addressed, the vision and objectives are being communicated with strategic assumptions, and criteria have been set for measuring the project's success;\nb) there is ongoing justification for the project and the business case is being updated, if required by the organizational governance;\nc) the solution, in terms of outputs, outcomes and expected benefits, is likely to meet the needs of the organization;\nd) appropriate and competent resources are being used;\ne) work is terminated when the organizational justification is no longer supported.\nNOTE See 4.5.4 and 4.5.3 for the project sponsor's and project board's role concerning directing a project."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.5 Initiating a project",
      "subsubtopic": "6.5.1 Overview",
      "content": "The purpose of initiating a project is to plan the project, define the project organization, mobilize the project team, define project governance and management, identify stakeholders and verify the project is justified. Lessons learned from previous, relevant projects should be considered. The activities can be iterative, until an acceptable solution and plan is developed and can be further iterated in subsequent phases of the project.\nNOTE 1 \"Initiating a project\" can also be referred to as \"starting a project\" or \"project initiation\".\nNOTE 2 See 4.5.6 for the project manager's role concerning initiating a project."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.5 Initiating a project",
      "subsubtopic": "6.5.2 Project team mobilization",
      "content": "The project manager should mobilize the team, facilities, equipment and other resources required to undertake the project. The project team should understand their roles and the project's requirements, assumptions, constraints and potential risks. Project work should be undertaken in cross-functional teams and assigned to individuals who are competent to accomplish the role and have the capacity to deliver the expected results. See 7.5 for further information."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.5 Initiating a project",
      "subsubtopic": "6.5.3 Project governance and management approach",
      "content": "The governance and management framework should be defined to provide direction and working methods to those individuals involved in the project. Governance and management frameworks, as well as controls, should be proportionate and appropriate to the work to be done and its expected degree of complexity.\nThe project manager, in consultation with the project sponsor should define the way in which the project is to be initiated, directed, monitored, controlled and closed, while conforming to the governance requirements (see 4.3). Typically, this should include:\na) project life cycle (see 4.4);\nb) project organization, roles and responsibilities (see 4.5);\nc) processes and methods for undertaking the management activities described in Clauses 6 and 7;\nd) processes and methods for delivering the project's outputs and outcomes (see 6.7).\nThe project management approach can be described in a single document, a single overarching document with a set of subsidiary documents or a set of subsidiary documents covering specific practices, such as a risk or quality management plan (see ISO 21505).\nNOTE The names of documents describing the management approach can differ. Example names include \"project management plan\", \"project initiation documentation”, “project definition document\", \"project implementation plan\", \"project charter\" and \"project terms of reference\". Subsidiary documents for specific project management practices are sometimes referred to as \"management plans”, e.g. \"risk management plan or strategy\", \"quality management plan or strategy\", \"scope management plan or strategy\"."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.5 Initiating a project",
      "subsubtopic": "6.5.4 Initial project justification",
      "content": "The initial justification for the project should build on the rationale in the preliminary justification from the pre-project activities (see 6.2). This justification should be documented in a business case (see 4.3.2). The business case can be developed over a number of project phases as work progresses and should be updated to reflect significant changes in the project's context and scope.\nThe business case should demonstrate the fit to the organization's strategy, financial viability, commercial viability and practicality of delivery within an acceptable level of risk. Alternative options for the approach to be taken and solution to be selected should be assessed and reasons for rejection given. If a project is part of a programme, its business case can be included within the programme's business case.\nNOTE While the document justifying the undertaking of a project is often referred to as a \"business case”, the actual name used can vary from sector to sector or the method used."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.5 Initiating a project",
      "subsubtopic": "6.5.5 Initial project planning",
      "content": "An initial plan for the project should be developed with milestones and gates or decision points based on the project life cycle combined with a detailed plan for at least the immediate phase of the project. The transition of outputs to operations or customer should be considered if the transition is considered part of the project. At this early stage of the project, this consideration can include several options, which can be developed further in later phases of the project (see 7.2)."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.6 Controlling a project",
      "subsubtopic": "6.6.1 Overview",
      "content": "The purpose of controlling a project, including phases and work packages, is to monitor and measure performance against an agreed plan, including authorized changes. The project manager should build on the project's initial plan (see 6.5.5), adding detail as the activities, deliverables or outputs are designed and developed, and reflecting authorized changes, as required (see 7.2).\nNOTE See 4.5.6 for the project manager's role concerning controlling a project."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.6 Controlling a project",
      "subsubtopic": "6.6.2 Progressive justification",
      "content": "The justification for the project can be further developed over several phases of the project, for different options, as work progresses. The business case should be updated, in consultation with the project sponsor, to reflect changes in the project's context and scope, prior to every gate or decision point to validate continuing the project."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.6 Controlling a project",
      "subsubtopic": "6.6.3 Managing project performance",
      "content": "The project manager, supported by the project team, should regularly review required outputs and outcomes to meet the requirements. The project manager should monitor and verify the performance of the project team in undertaking the work assigned to them in the project plan to:\na) integrate the project team's work into subsequent project work;\nb) confirm the project is likely to deliver what is required at an acceptable level of risk and recommend and make authorized controlled changes.\nThe project manager should collect and analyse progress and performance data to assess progress relative to the agreed project plan, including:\n— work completed, milestones achieved and costs incurred (see 7.2);\n— benefits planned or realized (see 7.3);\n— managing the scope (see 7.4);\n— acquiring sufficient resources to complete the work (see 7.5);\n— managing the schedule and costs (see 7.6 and 7.7);\n— identifying and managing risks and issues (see 7.8 and 7.9);\n— managing change control (see 7.10);\n— quality of work (see 7.11);\n— status of planned and forecasted stakeholder engagement and communications (see 7.12 and 7.13);\n— managing the transition of outputs to the sponsoring organization or customer, and preparing for and managing organizational or societal change (see 7.14);\n— reporting on progress (see 7.15);\n— maintaining the integrity and availability of information and documentation (see 7.16);\n— managing the status of procurement activities (see 7.17);\n— new lessons learned (see 7.18).\nThe project manager should provide the project sponsor, project team and selected stakeholders with a report of the project's status and performance in alignment with the project's plan (see 7.15). A projection for the project's future performance should be included.\nThe project manager should manage the various technical, administrative and organizational activities and interfaces within the project.\nPreventive and corrective actions should be documented and implemented, and change requests made and implemented (see 7.10), when necessary, to keep the project on target to continue to achieve the project's objectives."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.6 Controlling a project",
      "subsubtopic": "6.6.4 Managing the start and close of each project phase",
      "content": "With the assistance of work package leaders or other subject matter experts, the project manager should prepare for starting each phase of the project by:\na) preparing or reviewing a detailed plan for the phase;\nb) reviewing the governance and management requirements;\nc) confirming, with the project sponsor, that the project is still justified;\nd) revising the management approach to reflect the work required in the phase;\ne) obtaining authorization to start the next phase.\nOnce the start of the phase has been authorized, the project manager should mobilize the team and other resources and begin work.\nThe project manager should confirm the completion of each phase of the project by including, but not limited to:\n— confirming completed, cancelled or suspended procurements;\n— verifying any incomplete actions and recording unresolved issues;\n— releasing or transitioning resources, if no longer required;\n— archiving information and documentation in accordance with the organization's information retention policy;\n— verifying completed, delivered and accepted outputs and outcomes;\n— recording lessons learnt."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.6 Controlling a project",
      "subsubtopic": "6.6.5 Managing the start, progress and close of each work package",
      "content": "The project manager should oversee the work packages within each phase by:\na) verifying and approving the plan for each work package, after ensuring that it is consistent and integrates with the overall plan for the project and the respective phase;\nb) assuring the integration work and deliverables between and among work packages are planned and undertaken and meet the requirements;\nc) assigning responsibility for each work package to a work package leader;\nd) initiating work packages in accordance with the project plan or in response to a risk or issue;\ne) verifying progress of the work, including addressing any risks, issues or change requests;\nf) verifying the quality of the deliverables;\ng) confirming completion, handover of deliverables and closure of the work package."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.7 Managing delivery",
      "subsubtopic": null,
      "content": "The purpose of managing delivery is to define the required outputs and outcomes, and to plan and implement their delivery enabling the project's outcomes to be achieved and benefits realized.\nThe project's work can be organized into work packages for assigning and controlling work conducted by various teams. Work packages should be assigned to the work package leader (see 4.5.8). Work should be appropriately defined, planned, monitored and controlled, and quality should be actively managed. Working methods and processes should be tailored for use to maximize the likelihood of success within the project environment. The work package leader should monitor, measure and control the assigned work against the project's approved plan using the practices defined in Clause 7. Preventive and corrective actions should be taken, and change requests made, when necessary, to achieve the assigned work objectives.\nThe work package leader should manage the delivery of their work packages by, but not limited to:\na) planning the assigned work packages (see 7.2 to 7.7);\nb) mobilizing the team;\nc) addressing risks, issues, change requests and stakeholders' views (see 7.8, 7.9, 7.10 and 7.12);\nd) managing suppliers, if any (see 7.17);\ne) developing the required outputs using appropriate and proportionate methods and techniques (see 7.11);\nf) verifying and validating the deliverables;\ng) keeping the project manager informed of progress, escalating risks, issues and requests for decisions and direction (see 7.15);\nh) capturing and applying lessons learned (see 7.18);\ni) closing the work package once it has been confirmed as completed by the project manager (see 6.6.5);\nj) maintain records of the work undertaken (see 7.16).\nNOTE 1 Outputs are sometimes referred to as \"assets\" (see ISO 55000).\nNOTE 2 See 4.5.8 for a work package manager's role concerning managing delivery."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.8 Closing or terminating a project",
      "subsubtopic": null,
      "content": "The purpose of closing a project is to confirm the completion of the project's scope, to note those activities not completed in the case of termination, to enable post-projects benefit realization, and to manage the demobilization of any remaining resources and facilities. Prior to the project being closed, if not due to termination, the completion of all activities should be verified to confirm that the project's scope has been completed, and each work package has either been completed or terminated. Also, where applicable, any remaining operational responsibilities should be agreed and accepted.\nIf the project is part of a programme or portfolio, responsibility for tracking incomplete actions, risks and issues should be transferred to the programme or portfolio manager. If the project is not part of an existing programme or portfolio, a determination should be made as to whether incomplete actions, risks and issues should be transferred to an appropriate management authority or to another designee for further tracking and management. Any contracts that were established to achieve part of the project's scope should be reviewed, their status verified and, if appropriate, they should be formally closed (see 7.17).\nThe project manager in consultation with the project sponsor, key team members and stakeholders should perform a closure review. The closure review should assess performance against the plan, and the extent to which objectives were met. This review should be formally documented, and the formal documentation should be used as the basis for authorizing project closure. The project sponsor should agree the terms of reference and timing for any post-closure reviews.\nA review of lessons learned throughout the project should be carried out, including recommendations for improvements to be considered in the management of similar and other future projects (see 7.18). Such a review can be part of any formal closure review or conducted as a separate activity.\nStakeholders should be informed about closure. Actions should be taken to enable a handover of the project's outputs, and any related organizational or societal change management actions, including enabling benefits realization, during the handover. Actions should also be taken to enable ongoing benefits realization.\nPrior to completion, a project can be terminated by the project sponsor or sponsoring organization for the following reasons, including but not limited to:\na) the project is no longer needed or viable;\nb) the risks associated with it have become unacceptably high;\nc) the external customer no longer wants the outputs.\nUnless special reasons exist, terminating a project should comprise similar activities as completing a project, even though there may not be a final output to release.\nIn the case of termination of the project, the following actions should be taken:\n— confirm and document completed activities, including those activities undertaken by suppliers;\n— document activities not completed;\n— confirm deliverables that should be transferred to the customer;\n— confirm and record the customer's acceptance (or rejection) of deliverables which have been identified as needing to be handed over;\n— record the status of work packages;\n— collect and archive project documents in accordance with the prevailing organizational policy (see 7.16);\n— release project resources and facilities;\n— agree on any ongoing operational responsibilities;\n— close or terminate work orders and contracts as needed."
    },
    {
      "topic": "6 Integrated project management practices",
      "subtopic": "6.9 Post-project activities",
      "subsubtopic": null,
      "content": "NOTE See 4.5.6 for the project manager's role concerning closing or terminating a project.\nThe purpose of the post-project activities is to verify that the outcomes are sustainable, and the expected benefits are being realized.\nThe project sponsor for projects under programmes or portfolios, or those requiring post-closure activities should ensure that a review is undertaken to determine the degree of the project's success, including:\na) meeting the defined objectives;\nb) realizing benefits;\nc) delivering organizational or societal changes or outcomes, such as operational performance;\nd) achieving sustainable changes, including continuing to meet the expectations set in the business case.\nBenefits and organizational or societal changes may or may not be included in the project's scope.\nLessons learned should be captured and communicated (see 7.18).\nNOTE See 4.5.2 for the sponsoring organization's role concerning post-project activities."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.1 Overview",
      "subsubtopic": null,
      "content": "This clause describes the individual project management practices that should be considered throughout a project and that can be used when undertaking the integrated project management practices described in Clause 6. These practices are shown in Figure 8.\nApplication of the concepts and practices described in this document can vary in emphasis for a given project depending on the project's context and the delivery approach used."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.2 Planning",
      "subsubtopic": "7.2.1 Overview",
      "content": "The purpose of planning is to define the requirements, deliverables, outputs, outcomes and constraints, and to determine how the project's objectives should be achieved. When developing a plan, different solutions, delivery approaches and implementation options should be considered."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.2 Planning",
      "subsubtopic": "7.2.2 Developing the plan",
      "content": "Planning should be a collaborative activity, where possible, involving team members advising on planning their work. Estimates should be justifiable. A plan can include:\na) benefits to be realized (see 7.3);\nb) scope: outputs and outcomes to be delivered (see 7.4), taking quality into account (see 7.11);\nc) resources needed, such as people, materials, tools and equipment and other organizations (see 7.5);\nd) schedule: when activities are to be done (see 7.6);\ne) cost (see 7.7);\nf) risks inherent in the plan (see 7.8);\ng) assumptions and constraints.\nDependencies between activities and other work components (such as programmes and projects) should be defined. The plan should include and allow for assurance and decision-making activities. The plan can be based on a hierarchy showing each work component's place in the hierarchy with single-point accountability assigned for each work package and activity. Plans should be viewable at different levels of the hierarchy and show the level of detail appropriate to the needs of those viewing the plan.\nPlanning should be iterative and progressive through the life cycle of a project, with more detail for the immediate future than for more distant work. As work progresses, scope can be refined and clarified, to develop a plan which can be delivered at an acceptable level of risk. A plan may include an indication of the current level of certainty by, for example, using ranges or confidence indicators."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.2 Planning",
      "subsubtopic": "7.2.3 Monitoring the plan",
      "content": "The plan should be consistent and integrated. The plan should be sufficiently detailed to establish baselines. Such baselines can reflect any aspect of the plan, such as requirements, scope, quality, schedule, costs, resources and risks. Changes to a baseline plan should be undertaken in a controlled way (see 7.10).\nOnce approved, progress against the plan's baseline should be regularly monitored and analysed and used to inform reporting (see 7.15). Forecasts should be made of future activities, taking into account progress to date and prevailing assumptions and risks. Plans should be reviewed, especially prior to significant decision points, such as project gates (see 4.4)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.3 Benefit management",
      "subsubtopic": "7.3.1 Overview",
      "content": "The purpose of benefit management is to assist the sponsoring organization and the customer in realizing the desired benefits of a project from the project's outcomes, as described in the project's business case or other similar documentation. Benefits should be an integrated part of the project's plan, if the realization of benefits is within the project's scope (see 7.2):\nThe project's objectives and desired benefits should be identified, analysed, prioritized, documented and communicated to the project's stakeholders. Planned activities should be defined to facilitate the monitoring and control of the desired benefits."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.3 Benefit management",
      "subsubtopic": "7.3.2 Identifying and analysing benefits",
      "content": "Benefit identification and analysis should begin when the potential project is being considered (see 6.2). Benefits are mainly determined by the project sponsor in conjunction with the sponsoring organization and stakeholders. Benefits should be included in a business case and can be further detailed in supporting documents. The deliverables can be used to create outputs, organizational and societal changes or outcomes that in turn can realize benefits for the sponsoring organization or the customer.\nAfter the project has been established with a business case, a more detailed set of benefits to be realized should be identified, analysed, prioritized and decided by the project sponsor, or other authorized body, such as a project board (see 4.5).\nBenefit identification and analysis should include, but is not limited to:\na) identifying and prioritizing expected benefits;\nb) identifying possible negative impacts from the expected benefits;\nc) identifying additional benefits throughout the project life cycle;\nd) identifying the extent of any organizational and societal change needed;\ne) identifying stakeholders for each benefit to be realized;\nf) aligning benefits with strategic and other objectives;\ng) defining performance metrics and reporting for each benefit;\nh) determining time frames for benefit realization;\ni) verifying that the planned outputs and outcomes are likely to realize the required benefits.\nNOTE Potential projects are dealt with in the pre-project period (see 6.2 and Figure 7)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.3 Benefit management",
      "subsubtopic": "7.3.3 Monitoring benefits",
      "content": "The monitoring of benefits includes, but is not limited to:\na) monitoring progress throughout the project life cycle towards the achievement of outcomes and their impact on the realization of intended benefits;\nb) collecting performance measurements for each benefit;\nc) reporting and communicating the status of expected benefits.\nIntended benefits can be impacted by changes to the plan. The project manager should inform the project sponsor of potential impacts resulting from any change to the plan (see 7.10). Benefits can be realized during the project, at the end of the project or after the project has closed. Before the end of the project, the responsibility for the future realization of benefits, if any, should be transferred to the stakeholders responsible for realizing the ongoing or future benefits."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.3 Benefit management",
      "subsubtopic": "7.3.4 Maintaining benefits",
      "content": "If within the scope of the project there are deviations from the planned benefits, corrective, and when required, preventive action should be undertaken."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.4 Scope management",
      "subsubtopic": "7.4.1 Overview",
      "content": "The purpose of scope management is to facilitate the creation of the deliverables, outputs and outcomes to achieve the stated objectives of the sponsoring organization or customer. Scope management enables only formally approved work being incorporated into the project. The scope should be an integrated part of the project's plan (see 7.2).\nThe scope should be defined (see 7.4.2). Management activities should be carried out to enable scope deviations to be managed and to confirm the delivery of the scope."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.4 Scope management",
      "subsubtopic": "7.4.2 Defining the scope",
      "content": "Defining the scope should clarify what the project is planned to contribute to the objectives of the sponsoring organization or customer. The defined scope should be used as a factor to consider in future decisions, as well as when communicating the importance of the project and its objectives and benefits. The scope should reflect the requirements and their associated acceptance criteria and should be refined and clarified as work progresses.\nThe authorized work that forms the project's scope can be defined in terms of the project's objectives, mapping or in a work breakdown structure. As appropriate, the scope should be further elaborated and broken down into pieces of work in a work breakdown, or other type of structure. The breakdown identifies, defines and documents the work needed to provide a basis for planning (see ISO 21511). Associated acceptance criteria should be agreed."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.4 Scope management",
      "subsubtopic": "7.4.3 Controlling the scope",
      "content": "Controlling the scope should involve maximizing positive and minimizing negative impacts resulting from scope changes (see 7.10). The current scope status should be compared to the approved baseline in order to determine any variance. Controlling the scope also should be concerned with influencing the factors that provide scope changes and controlling the impact of those changes on the project's objectives. Scope change requests should be managed in a controlled manner and be integrated with the other control domains (see 7.10)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.4 Scope management",
      "subsubtopic": "7.4.4 Confirming scope delivery",
      "content": "The delivery of outputs and outcomes comprising the scope of the project should be confirmed in accordance with the defined acceptance criteria, including:\na) verifying and validating that the project's quality requirements and quality standards have been met (see 7.11);\nb) confirming that the sponsoring organization, customers and other stakeholders are ready to receive, and, where appropriate, use the project's deliverables;\nc) managing the handover of deliverables and, where relevant, responsibilities, from the project team to the sponsoring organization or customer;\nd) obtaining confirmation that handover was completed.\nNOTE See 7.14 for managing organizational and societal change resulting from the project."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.5 Resources management",
      "subsubtopic": "7.5.1 Overview",
      "content": "The purpose of resources management is to determine the resources needed to deliver the scope of the project in terms of quality, quantity and optimum usage. Resources should be an integrated part of the project's plan (see 7.2).\nResources can include people, facilities, equipment, materials, infrastructure and tools. Resources management should involve planning, managing and controlling resources to determine the resource quality, quantity and necessary optimization needed for achieving the objectives of the project.\nThose individuals involved in resources management should understand the critical aspects of human resource management regarding competence, experience, availability, behaviour and culture. Requirements and attributes for resources, such as origin, time required and start and end dates for resources should be defined, recorded and updated as necessary.\nConflicts in the availability of resources can occur due to unavoidable circumstances, such as equipment failure, weather, labour unrest, technical problems or competing demands of other work."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.5 Resources management",
      "subsubtopic": "7.5.2 Planning the project organization",
      "content": "Human resources involved in the work should be justified and assigned according to the roles and responsibilities needed to complete the work. These responsibilities should be defined according to a specific project organization, which can be aligned with the appropriate levels of the work (see 4.5).\nA project organization can be defined and influenced by various factors, such as the organization's structures, its policies, the project's environment and the type of project. In planning the project organization, the project's stakeholders' needs, opportunities and requirements should be considered.\nHuman resource planning and selection should address several factors, such as, but not limited to, internal or external sources, competencies, applicable and relevant legal requirements, period and timing of engagement, calendars, and development and training requirements."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.5 Resources management",
      "subsubtopic": "7.5.3 Establishing the team",
      "content": "Establishing the team includes acquiring the resources needed and providing them with directions to carry out their work. The work location, commitment, roles and responsibilities, as well as reporting requirements should be established. The project manager should determine how and when project team members need to be acquired and allocated to the project, as well as how and when they should be released from the project. In some situations, it is possible that the project manager does not have complete control over the selection of the project team members. When relevant, the work package leaders should be involved in selection of project team members assigned to work on their packages.\nA team should normally be established at the start of each project phase or work package. The team composition should be reassessed and revised, if necessary. When establishing a team, the project manager should take into consideration factors such as skills and expertise, culture, cost and group dynamics.\nWhen appropriate human resources are not available within the organization, consideration should be given to hiring or contracting resources (see 7.17)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.5 Resources management",
      "subsubtopic": "7.5.4 Developing the team",
      "content": "Developing a team aims to help the team members work together in a cohesive and collaborative way. This development should depend on the competencies of the project team and can necessitate improving the performance and interaction of team members in a continual manner to enhance teamwork, motivation and performance.\nGround rules of acceptable behaviour should be established early in the project to minimize misunderstandings and conflicts. Competency gaps should be identified and filled with appropriate training, coaching and other initiatives, involving actions to improve group dynamics and professional growth."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.5 Resources management",
      "subsubtopic": "7.5.5 Managing the team",
      "content": "Managing the team should aim at motivating the team and maintaining a positive working environment, where team members feel involved, perform at their best and focus on their assigned work and the project's objectives. The project manager should seek to optimize team performance by providing feedback, resolving personal disputes and encouraging collaborative working.\nWhen conflicts occur, they should be managed appropriately, according to the situation. Appropriate leadership and management styles should be adopted using negotiation, assertiveness, empathy and evidence-based decisions, as appropriate."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.5 Resources management",
      "subsubtopic": "7.5.6 Planning, managing and controlling physical and material resources",
      "content": "The availability and use of physical and material resources should be planned, managed and controlled. To this aim, the project manager and team should consider and trade-off the best cost-benefit solutions, according to resource availabilities and the project's requirements. Resources, such as materials, equipment, facilities, laboratories and tools should be planned according to factors such as criticality, cost, availability and lead times. This resource planning should often be coordinated with human resource planning, competence and budget.\nThe management of equipment and material resources should be coordinated with the project's schedules (see 7.6) and take into account potentially conflicting situations, such as the risks of unavailability and delivery failure. Alternative resources and resource assignments should be considered.\nThe performance and productivity of resources and the extent to which objectives are being, or are likely to be met, should be checked. Preventive and corrective action should be taken when necessary."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.6 Schedule management",
      "subsubtopic": "7.6.1 Overview",
      "content": "The purpose of schedule management is to enable work to be undertaken in a timely manner and to reduce slippage to an acceptable level. The schedule should be an integrated part of the project's plan and developed under the direction of the project manager (see 7.2).\nSchedule management should involve sequencing activities, estimating activity durations and developing and controlling the schedule, as committed to by the team undertaking or impacted by the work. Activities should be logically sequenced to support the development of a realistic, achievable and controllable schedule. Activities within the project should be described with dependencies in order to determine the critical path or to identify alternative approaches.\nThe project manager should monitor progress against the approved schedule baseline to enable the project's scope to be delivered on time, within established schedule constraints and objectives. Controlling the schedule should include monitoring the status of phases, work packages and activities related to the project. Controlling also should involve managing the changes to the schedule, monitoring milestones and introducing other controls, as deemed appropriate. Techniques such as earned value management can be used to monitor progress and predict future performance (see ISO 21508)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.6 Schedule management",
      "subsubtopic": "7.6.2 Estimating activity durations",
      "content": "Before developing the schedule, the project manager should work with the project team to estimate the duration of the project's activities. Future activities can be defined in less detail than immediate activities. As the project progresses and more information becomes available, activities can be further defined and detailed. Activity durations can represent a trade-off between schedule constraints and resource availability. Periodic re-estimates resulting in updated forecasting against the baseline schedule can also be necessary. Activity duration estimates should be reconsidered throughout the life of the project. Once the activities are baselined, change requests should be used (see 7.10). At the same time, new risks and other events impacting the project should be identified."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.6 Schedule management",
      "subsubtopic": "7.6.3 Developing the schedule",
      "content": "Activities should be scheduled according to the delivery approach used. The activity level should provide sufficient resolution for undertaking work, assigning resources, finalizing the budget and management control. In addition to an activity network diagram, other scheduling formats can be adopted.\nThe schedule should be developed to determine:\na) whether the project's objectives can be achieved on schedule;\nb) the critical path and its related risks;\nc) actual progress achieved in schedule against a predefined baseline schedule.\nSchedule development and verification should continue throughout the project. As work progresses, the project's plan changes, anticipated risks occur or disappear, and new risks are identified. If necessary, duration and resource estimates should be reviewed and revised to develop an approved project schedule that can serve as the revised baseline against which progress can be tracked."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.6 Schedule management",
      "subsubtopic": "7.6.4 Controlling the schedule",
      "content": "Once the project's schedule and the baseline have been approved, the work should be controlled, variances identified, and appropriate preventive and corrective actions taken, if necessary.\nThe project manager should be aware of the implications of delays in the early phases of the project and their impact on the project's objectives. Trade-offs between different constraints, such as risk and cost (see 4.2.4), should be considered when deciding on a response to any observed schedule slippage. Controlling the schedule should realign the schedule objective to the original baseline or produce a new baseline (see 7.10) with the least impact possible considering the project's constraints. Action to exploit the opportunities when work is completed early should be considered.\nWhen controlling the schedule, the focus should be on:\na) determining the progress achieved to date;\nb) comparing progress to the approved schedule baseline to determine any variance;\nc) forecasting completion dates;\nd) implementing appropriate preventive or corrective actions to avoid adverse schedule delays.\nForecasts of schedules at completion should be routinely developed and updated based on past trends and current knowledge. Schedule accelerations can also be possible, using contingency or management reserves and other project management strategies. In managing the schedule, overall progress can be reviewed using historical and productivity data, progress data, project plans, resource requirements, and risks identified and recorded."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.7 Cost management",
      "subsubtopic": "7.7.1 Overview",
      "content": "The purpose of cost management is to establish the financial controls to be used throughout the project life cycle to facilitate delivery of the project within the approved budget. The budget should be an integrated part of the project's plan (see 7.2).\nCost management should involve estimating costs for each element of work, developing a budget, acquiring funds and controlling the project's costs. Techniques such as earned value management can be used to monitor costs and predict future performance (see ISO 21508)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.7 Cost management",
      "subsubtopic": "7.7.2 Estimating cost",
      "content": "Estimating costs should involve developing an approximation of the costs needed to complete each project activity. Cost estimates should be established at least for the first phase, as well as for the entire project. Cost estimates can be expressed in units of measure, such as labour hours, number of equipment hours or currency valuations.\nWhere projects are costed in more than one currency, the exchange rates used should be documented. Reserves or contingency funds may be used to deal with uncertainties and, if used, should be clearly identified in the cost estimate."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.7 Cost management",
      "subsubtopic": "7.7.3 Developing the budget",
      "content": "The assignment of budgets to scheduled work elements should provide a schedule-based budget against which actual performance can be compared.\nThe total cost of the project should be estimated, and a budget defined that identifies when funds need to be available and when costs are expected to be incurred. A method should be defined and established for managing and measuring cost performance in line with funding limits and requirements. Objective measures of cost performance should be established when budgeting. Setting objective measures in advance of cost performance assessments enhances accountability and avoids bias.\nProject cost estimating and budgeting are closely linked. Reserves or contingency items not assigned to activities or other work scope elements can be created and used for management control purposes or to cover unforeseen costs. Such items and how they should be spent, together with associated risks, should be clearly identified. Allocation of the budgeted funds to work activities establishes a baseline for monitoring and enables re-baselining the budget when change requests are authorized."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.7 Cost management",
      "subsubtopic": "7.7.4 Controlling costs",
      "content": "Controlling costs should be focused on determining the present cost status, comparing it to the baseline costs to determine any variance, forecasting projected costs at completion and implementing appropriate preventive or corrective actions.\nOnce work has started, performance data should be accumulated, including budgeted costs, actual costs and estimated cost at completion. To evaluate the project's performance, it is necessary to combine costs with the accumulated scheduling data, such as the progress of scheduled activities and the forecasted completion dates of current and future activities.\nIn controlling costs, several resources can be reviewed, including budget, actual costs and cost estimates, forecasted costs, progress data, activity lists, change requests and authorized changes, corrective actions and the project's plan.\nMonitoring actual costs and expected future costs, as well as related cost variances, should enable the project team to take appropriate actions to keep the project within the budget or make a case for requesting additional funding."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.8 Risk management",
      "subsubtopic": "7.8.1 Overview",
      "content": "The purpose of risk management is to increase the likelihood of achieving the project's objectives. Identified risks and options for addressing each risk should be an integrated part of the project's plan (see 7.2).\nIdentifying risks is the responsibility of all members of the project team and should involve determining potential sources of risk and their characteristics that, if they occur, can have either a positive or negative impact on the project's objectives. Risk management should involve identifying, assessing, treating, controlling and responding to risks, throughout the project life cycle."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.8 Risk management",
      "subsubtopic": "7.8.2 Identifying risk",
      "content": "Risks can be identified throughout the project life cycle and previously identified risks can change or reoccur. Risks should be recorded when identified. Risks can originate from various sources, either internal or external to the project. Each risk should have an assigned owner.\nNOTE The record of risks can be referred to as a \"risk register\", \"risk log\" or any other term used within an organization."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.8 Risk management",
      "subsubtopic": "7.8.3 Assessing risk",
      "content": "Each risk should be assessed for probability, consequence and proximity, and prioritized for further action. Interrelations and dependencies between individual risks should be assessed.\nNOTE 1 Consequence can also be referred to as \"impact\".\nNOTE 2 Probability can also be referred to as “likelihood”."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.8 Risk management",
      "subsubtopic": "7.8.4 Treating risk",
      "content": "Treating risks should involve developing options and actions to enhance opportunities and reduce threats to the project. Risk treatment measures can include, but are not limited to:\na) accept;\nb) avoid;\nc) mitigate;\nd) transfer;\ne) use contingency;\nf) exploit;\ng) enhance.\nActions taken to treat a given risk should be appropriate to the threat or opportunity, cost-effective, timely, realistic within the project's context, understood by the parties involved and assigned to an appropriate owner.\nResidual risks can result from the measures taken to treat each risk. When treating risks, a deviation from the plan or a change to the baseline can be needed (see 7.10)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.8 Risk management",
      "subsubtopic": "7.8.5 Controlling risk",
      "content": "Controlling risks should involve ensuring that responses to negative risks minimize disruption to the project while responses to positive risks maximize beneficial impact, by determining if the risk responses are undertaken and whether they have the desired effect. In controlling risk, management information can be reviewed, including the relative priority of risks, progress data, project plans, change requests and corrective actions. Tracking the development of risk, as well as tracking the effectiveness of the risk treatment, should be part of controlling risks."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.9 Issues management",
      "subsubtopic": "7.9.1 Overview",
      "content": "The purpose of issue management is to resolve issues such that there is no negative impact on the achievement of the project's objectives."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.9 Issues management",
      "subsubtopic": "7.9.2 Identifying issues",
      "content": "Issues should be identified as they occur. Most issues should be dealt with to minimize their negative impact or exploit their positive impact on the project. In defining each issue, the project team should include the pertinent facts surrounding the issue. A safe and reliable method for the project's stakeholders to raise issues should be established. Identification of issues affecting the project should be undertaken at all levels and managed by the project team. Issues should be clearly defined and understood by the stakeholders involved.\nIssues should be initially recorded and analysed as soon as they are identified so that they can be prioritized and those issues with the highest impact on the project's objectives can be dealt with first. Responsibility should be assigned for managing each issue to its resolution. Recording issues helps capture the details of each issue, so that the project team can see the status of the issue and who is responsible for resolving it. Details of each issue can include a title or name, the type of issue, the date an issue was identified, the issue description, priority, impact summary, action steps and current status.\nNOTE The record of issues can be referred to as an \"issues register\", \"issues log\" or any other term used within an organization."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.9 Issues management",
      "subsubtopic": "7.9.3 Resolving issues",
      "content": "Issue resolution involves recording and handling an event or problem that has happened and threatens the success of the project or represents an opportunity to be exploited. A means of escalating issues to the appropriate management level for decision-making should be established to deal with issues based on recommendations from the team and other appropriate stakeholders. Issue management planning and the approach for resolving issues should be incorporated in the project's governance and management framework (see 6.5.3) by outlining the method to be used to evaluate and address issues.\nThe decision and rationale for the resolution of an issue should be communicated to the appropriate project team members, originator and stakeholders. Issues resolution should incorporate an escalation mechanism that can be used to raise the level of awareness or priority when either the resolution is not forthcoming or the resolution offered is not deemed practical or satisfactory to the relevant stakeholders. Issue resolution includes assessing the impact of the issue and the actions needed to be in place to resolve it. The resolution of issues should be recorded for future referencing and learning. When resolving issues, a deviation from the plan or a change to the baseline can be needed (see 7.10)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.10 Change control",
      "subsubtopic": "7.10.1 Overview",
      "content": "The purpose of change control is to control changes to the project and deliverables and to formalize acceptance or rejection of these changes.\nChanges can originate from deviations identified in the project's performance or from any stakeholder, including policymakers, executive management, end users, suppliers or team members. Alternatively, a change can result from a response to a risk or issue. Change control should include establishing a framework for the project that includes activities for identifying, assessing, implementing and closing change requests.\nNOTE Assessing includes determining the impact of the changes on the project's constraints (see 4.2.4)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.10 Change control",
      "subsubtopic": "7.10.2 Establishing a change control framework",
      "content": "A change control framework should define the change control process and tools to be used. Changes to the deliverables should be controlled through an established set of integrated procedures, such as configuration management."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.10 Change control",
      "subsubtopic": "7.10.3 Identifying and assessing change requests",
      "content": "Throughout the project, it is necessary to record change requests, evaluate them in terms of objectives, benefits, stakeholder expectations, scope, resources, schedule, cost, quality and risk, and to assess the impact and obtain authorized prior to implementation. Only authorized change requests should be implemented.\nNOTE The record of change requests can be referred to as a “change register”, \"change log” or any other term used within an organization."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.10 Change control",
      "subsubtopic": "7.10.4 Planning the implementation of change requests",
      "content": "The project manager should determine how a change can be implemented, if authorized. The planning approach outlined in 7.2 should be followed as rigorously for a change to an existing plan as for a new plan. Where appropriate, the project manager should verify that any related contracts are still appropriate and, if not, include the activities for varying the contract in the plan for implementing the change request (see 7.17)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.10 Change control",
      "subsubtopic": "7.10.5 Implementing and closing change requests",
      "content": "A change request should be authorized, modified, rejected or deferred as a result of the impact assessment. Once a change has been authorized, the decision should be communicated to the relevant stakeholders, the project documentation updated, as appropriate, and the change implemented. The status of the change request should be recorded and tracked, until it has been implemented and closed."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.11 Quality management",
      "subsubtopic": "7.11.1 Overview",
      "content": "The purpose of quality management is to increase the likelihood that outputs are fit for purpose or use. Quality should be an integrated part of the project's plan (see 7.2). Quality management includes identifying quality requirements with acceptance criteria and means of verification and validation, the standards to be used and the deliverables of the project, including internal, external, interim, final, tangible and intangible deliverables. Quality requirements and standards should be documented to demonstrate how the project would conform to quality requirements and standards.\nDue to the temporary nature of projects and their constraints, such as schedule, cost, quality, resources, risks and other parameters, new quality standards cannot easily be developed specifically for each project. Development and organizational acceptance of quality standards and product quality requirements can be originated beyond the project boundary. Acceptance of quality standards and product quality requirements is normally the responsibility of the customer or performing organization, whichever prevails. In addition, innovative and unprecedented projects can require setting of new standards, which can also impose new requirements, risks, sharing responsibilities between the project and organization and involving other stakeholders. Managing project quality should include developing a quality management plan and processes for quality assurance and quality control.\nProject stakeholders should be informed about the likelihood that the:\na) project will meet the objectives;\nb) deliverables will conform to quality requirements and standards;\nc) project outputs and outcomes will enable the realization of the expected benefits for the organization or society."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.11 Quality management",
      "subsubtopic": "7.11.2 Planning quality",
      "content": "Planning quality should determine the quality requirements, metrics and standards that are applicable to the project and its deliverables, and how those requirements are to be met.\nTo enable quality, the approaches, processes and methods used to determine requirements, to design the solution's outputs, to build and integrate the elements of the solution and to verify and validate these elements should be defined. It is against these identified approaches, processes, and methods that quality assurance and quality control can be conducted.\nQuality requirements, metrics and acceptance criteria are identified by stakeholders, standards and organizational quality policies and apply to internal, external, interim, final, tangible and intangible deliverables.\nPlanning quality should include:\na) determining and agreeing with the project sponsor and other stakeholders as to the objectives and relevant quality standards to be achieved;\nb) documenting quality metrics and acceptance criteria for the project's deliverables;\nc) establishing the tools, procedures, techniques and resources needed to achieve the agreed standards;\nd) determining methods, techniques and resources to implement the planned systematic quality activities;\ne) developing the defined approach to managing quality, including the type of reviews, responsibilities and participants, scheduled in accordance with the project's plan;\nf) consolidating quality information in the quality management plan."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.11 Quality management",
      "subsubtopic": "7.11.3 Assuring quality",
      "content": "Quality assurance should facilitate and enable conformity to applicable performance requirements, quality processes and standards, and includes:\na) communicating the objectives and relevant standards to be used and verifying that they are used;\nb) verifying conformity to the defined management approach for quality;\nc) verifying that the established tools, procedures, techniques and resources are being used;\nd) conforming to the planned approach to verify the output against the validated requirements and specifications, where relevant;\ne) performing audits by people who are independent of the project manager and team; they can be from another part of the sponsoring or performing organization, or from the customer's organization.\nChange requests (see 7.10) can result from quality assurance activities."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.11 Quality management",
      "subsubtopic": "7.11.4 Controlling quality",
      "content": "Quality control should be used to:\na) determine whether the project's objectives, quality requirements, quality metrics and standards are being met;\nb) identify causes of and ways to eliminate unsatisfactory performance.\nQuality control should consider progress data, deliverables and the defined management approach for quality, as well as results in quality control measurements, verified deliverables and inspection reports. The results should help identify causes of poor performance or inadequate product quality, and can lead to preventive and corrective actions and change requests.\nQuality control should be applied to the project's deliverables and outputs, and includes such activities as:\n— verifying that the deliverables and outputs meet the quality requirements by detecting defects using the established tools, procedures and techniques;\n— analysing possible causes of defects;\n— determining the preventive actions and change requests;\n— communicating the corrective actions and change requests.\nQuality control can be performed outside the project boundaries by other parts of the performing organization or by the customers."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.12 Stakeholder engagement",
      "subsubtopic": "7.12.1 Overview",
      "content": "The purpose of stakeholder engagement is to enable the needs, interests and concerns of stakeholders to be identified, understood and addressed sufficiently to enable the objectives to be met.\nProject stakeholders should be identified, analysed, documented and engaged throughout the project.\nStakeholder engagement should include the activities of identifying and characterizing the project's stakeholders. Planned engagement activities should be carried out to identify and address stakeholder's concerns and to employ stakeholder support and communication."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.12 Stakeholder engagement",
      "subsubtopic": "7.12.2 Identifying stakeholders",
      "content": "Stakeholders should be identified together with relevant information regarding their interests and involvement. This information can include levels of interest, influence, expectations and needs. Stakeholders should be actively involved in the project and can be internal or external to the project, at varying authority levels.\nStakeholders should include, but are not limited to:\na) the sponsoring organization and project team (see 4.5);\nb) customers;\nc) partners and suppliers;\nd) special interest or pressure groups;\ne) regulatory bodies;\nf) finance providers;\ng) shareholders;\nh) relevant external third parties."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.12 Stakeholder engagement",
      "subsubtopic": "7.12.3 Engaging stakeholders",
      "content": "The plan for engaging stakeholders should take into account the identified stakeholders, the project's plan and other project documentation. Engagement can include activities such as identifying stakeholder concerns, resolving issues and specific activities, such as communications (see 7.13), aimed at getting an appropriate level of key stakeholder involvement in decision-making (see 4.3.1) or other activities critical to project success.\nStakeholder issues should be resolved by using diplomacy, negotiation and, if necessary, escalation to a higher-level authority in accordance with the defined procedures. Alternatively, stakeholders' issues can be resolved by requesting assistance from individuals or third parties external to the project organization. Resolving stakeholders' issues can result in change requests (see 7.10)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.13 Communication management",
      "subsubtopic": "7.13.1 Overview",
      "content": "The purpose of communication management is to enable stakeholder interactions that are effective and likely to contribute to the successful delivery of the project's outcomes and the successful realization of benefits.\nThe communications approaches and methods chosen should be planned and documented. The success or failure of a project can depend on the effectiveness of communications and the degree to which the communications engage the stakeholders.\nPlanned communication activities should be carried out to understand the information needs of the stakeholders, including the level of information and frequency of communication. Planned communication activities should be monitored for effectiveness."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.13 Communication management",
      "subsubtopic": "7.13.2 Planning communication",
      "content": "Communications should be planned to match the stakeholders' needs and expectations and include feedback mechanisms and effectiveness measures. Where needed, communications should comprise a series of specific campaigns or events aimed at a specific audience, with a defined purpose and message using appropriate media.\nCommunications should focus on supporting the project's objectives by:\na) increasing understanding and cooperation among various stakeholders;\nb) providing timely, accurate and unbiased information;\nc) designing communication to minimize risk.\nFactors such as geographically dispersed stakeholders, languages, cultures and organizational affiliation should be considered together with the appropriate media to be used. Such factors can significantly affect how communication should be delivered."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.13 Communication management",
      "subsubtopic": "7.13.3 Distributing information",
      "content": "Communications in response to stakeholders' needs and expectations should be distributed using the agreed media, messages and timing.\nInformation distribution should provide for adequate levels of confidentiality, security and accuracy of the information, where relevant, and should be in accordance with the communication plan."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.13 Communication management",
      "subsubtopic": "7.13.4 Monitoring the impact of communications",
      "content": "The impact of communications should be monitored and assessed and, where appropriate, responded to. The communications plan should be adjusted, if needed, to achieve a successful outcome for the project. Monitoring should focus on the impact of communications on:\na) increasing understanding and cooperation among various stakeholders;\nb) providing timely, accurate and unbiased information;\nc) resolving communication issues to minimize risk."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.14 Managing organizational and societal change",
      "subsubtopic": "7.14.1 Overview",
      "content": "The purpose of managing organizational and societal change is to enable the project's desired outcomes to be delivered.\nIf the scope of a project includes delivering outcomes, managing organizational and societal change is needed to prepare, equip and support organizations and individuals to change how they undertake particular activities and, where appropriate, modify their behaviours. Change can be in a business context or for society in general or in a more specific context, such as in government-sponsored projects.\nChange can be adaptive (reintroducing or adapting a familiar practice), innovative (introducing a practice new to the practitioners), or transformative (introducing a practice that is new to the industry, organization, or society).\nThe project manager should work with the project sponsor and those stakeholders impacted by the required changes to achieve the required outcomes.\nThe management of change should include identification of the need for organizational change (whether inside or outside the sponsoring organization), identification of the specific changes needed, and the planning and implementation of the activities needed to undertake the changes.\nNOTE 1 Organizational changes include how an organization is structured, managed or operates, such as the introduction of new ways of working,\nNOTE 2 Societal changes include those changes which affect society, such as infrastructure (such as roads, rail, airports and water supply), new tax regimes, state pensions and benefits, housing, environment, health, safety and security."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.14 Managing organizational and societal change",
      "subsubtopic": "7.14.2 Identifying the need for change",
      "content": "For some projects, change is central to why the project was initiated, and organizational or societal changes are needed to deliver the desired outcomes. Within these projects, the project manager and the appropriate team should work with the project sponsor and the impacted stakeholders to identify the changes needed and develop a plan for implementing the required changes.\nA plan for undertaking the change should be developed to support organizations and individuals, such as users or citizens, to modify their approach and, where appropriate, behaviours, as related to the project's desired outcomes.\nThe plan for change should include a vision or blueprint of the desired future state. The development of this blueprint should include assessing the current state of the impacted stakeholders, identifying the required changes and applying the appropriate techniques for implementation of those changes. The plan should also include a high-level schedule showing when outcomes need to be achieved. Change techniques can include providing communications for instructional, influential and informational purposes, training, mentoring or providing equipment or other resources to the affected stakeholders, as well as the use of specialist organizational change management methods.\nNOTE The blueprint can be referred to as a \"target operating model\", \"future state\" or any other term used within an organization."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.14 Managing organizational and societal change",
      "subsubtopic": "7.14.3 Implementing the organizational and societal change",
      "content": "Upon implementation of the changes, the project sponsor, in coordination with the operational managers or representatives of the impacted organizations and stakeholders, should monitor how the changes are being received and that the desired outcomes are being achieved, or take action if necessary."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.15 Reporting",
      "subsubtopic": "7.15.1 Overview",
      "content": "The purpose of reporting is to provide the current status, forecast and analysis of the project. Reporting should be aligned with the current, and possibly updated, project documentation and determined from an analysis of project management information.\nThe reporting approach and methods should be planned and documented early in the project. During the project, reporting is performed and should be monitored and adjusted to maintain alignment with the needs and requirements of the recipients of the reports.\nNOTE Reporting is distinct from communications. Reporting focuses on providing the status, analysis of variances, and forecasts of future performance for the project, while communication focuses on meeting the information needs to enable stakeholder interactions that are effective and contribute to the successful delivery of the project's outcomes."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.15 Reporting",
      "subsubtopic": "7.15.2 Planning reporting",
      "content": "Reporting should be planned as a part of project governance (see 4.3) and is usually needed to inform people working at different levels of the project organization, of the status of the work within their responsibilities. Reporting needs should be defined, including but not limited to the content, author, recipients, frequency, confidentiality and format of each report needed."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.15 Reporting",
      "subsubtopic": "7.15.3 Managing reporting",
      "content": "Managing reporting should focus on confirming that appropriate and reliable information is being passed from one level of the project organization to another. Reporting can include but is not limited to reports:\na) from work package managers to the project manager, containing progress reports, decisions and direction required and team issues;\nb) from the project manager to the project sponsor and project board, reflecting the project's status, risks and issues;\na) from the project sponsor to key stakeholders reflecting that stakeholder's interests in the project.\nWhere reports are no longer relevant or do not meet the needs of the recipient, corrective action should be taken."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.15 Reporting",
      "subsubtopic": "7.15.4 Delivering reports",
      "content": "Reports should be delivered in a timely manner in accordance with the project's defined management approach for reporting (see 6.5.3). Where relevant, reports should comply with any confidentiality or security requirements."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.16 Information and documentation management",
      "subsubtopic": "7.16.1 Overview",
      "content": "The purpose of information and documentation management is to enable relevant and reliable information (physical and digital) to be available to those undertaking work and making decisions.\nInformation and documentation management comprises the secure and timely collection, storage, analysis, distribution and maintenance of accurate information necessary for activities such as planning, undertaking and auditing work, and supporting lessons learned and knowledge management. Information and documentation should be available and accessible for historical reference. Activities should include the establishment of a system for receiving, securely storing and identifying information and documentation, which needs to be managed and accessible. Project-related information and document management can need to be undertaken in accordance with the organization's information management and retention policies."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.16 Information and documentation management",
      "subsubtopic": "7.16.2 Identifying which information should be managed",
      "content": "The necessary information and documentation should be identified and managed in accordance with data confidentiality, security and accuracy requirements. Information and documentation related to a project can include plans, progress assessments, reviews, audits, quality reviews, contracts, reports, communications and specialist information relating to the outputs such as designs, specifications and standards."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.16 Information and documentation management",
      "subsubtopic": "7.16.3 Storing and retrieving information and documentation",
      "content": "A system should be defined and established for receiving, identifying, securely storing and maintaining information and documentation, such that the information and documentation can be distributed and is retrievable only by those individuals who are authorized to access it. The system should include business continuity measures in the event of a disruptive incident. The system should include disposal and retention requirements for all categories of project information which have been defined as needing to be managed.\nA system should be established to ensure the integrity of groups of related information, such as those systems used for configuration management."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.17 Procurement",
      "subsubtopic": "7.17.1 Overview",
      "content": "The purpose of procurement is to source products and services bought as part of resourcing the work that are of appropriate quality, represent value for money and can be delivered when needed within an acceptable level of risk.\nProcurement should be planned to use organizational procurement processes, if any, in line with the procurement strategy of the project. Procurement management should be integrated with planning (see 7.2).\nNOTE Procurement requires knowledge of relevant laws and practices and is often undertaken by specialists outside the project's organization, such as a sourcing specialist within the sponsoring organization."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.17 Procurement",
      "subsubtopic": "7.17.2 Planning procurement",
      "content": "A procurement strategy should be defined, taking into account:\na) the project's \"make or buy\" decisions;\nb) the delivery practices;\nc) the type of legally binding agreements;\nd) the procurement process to be used.\nTeam members procuring goods and services should identify the applicable procurement criteria to be used and processes to facilitate the acquisition of the products and services required from external sources.\nProcurement requirements should be validated with the project manager or designee from which procurement information and contract specifications should be developed and defined."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.17 Procurement",
      "subsubtopic": "7.17.3 Evaluating and selecting suppliers",
      "content": "Suppliers should be selected based on information obtained during the supplier identification and selection activities and verified.\nAn evaluation of each supplier's offer should be undertaken in accordance with the stated evaluation criteria.\nThe supplier's performance should be re-evaluated throughout the project in accordance with the contract requirements."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.17 Procurement",
      "subsubtopic": "7.17.4 Administering contracts",
      "content": "Administering contracts should:\na) involve the management of procurement relationships, monitoring contract performance, managing contract changes and corrections, dealing with claims and ending contracts;\nb) enable the contracted parties' performance to meet the project's requirements according to the terms of the legal agreement;\nc) include the collection of supplier performance data and maintenance of detailed records (see 7.15);\nd) be performed throughout the project, as needed.\nCommunications with the supplier relating to disputes should be conducted or followed up in writing to provide evidence of actions taken by the contracted parties. Contractual and legal advice should be sought."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.17 Procurement",
      "subsubtopic": "7.17.5 Closing contracts",
      "content": "Contracts can be closed under two circumstances, when:\na) the contract obligations of the parties have been met; or\nb) the contract is closed early, in accordance with the contract's termination clauses.\nWhen termination provisions are enacted, measures to minimize the cost and impact of the termination should be considered.\nOn contract closure, the associated contract documentation should be archived in accordance with the project's information management framework (see 7.16)."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.18 Lessons learned",
      "subsubtopic": "7.18.1 Overview",
      "content": "The purpose of learning lessons is to benefit from experience, avoid repeating mistakes and disseminate improved practices to benefit current and future projects teams."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.18 Lessons learned",
      "subsubtopic": "7.18.2 Identifying lessons",
      "content": "Throughout the project, the project team and key stakeholders should identify lessons concerning the technical and managerial aspects of the project. The lessons should be captured, compiled, formalized and stored."
    },
    {
      "topic": "7 Management practices for a project",
      "subtopic": "7.18 Lessons learned",
      "subsubtopic": "7.18.3 Disseminating lessons",
      "content": "Lessons should be disseminated and used throughout the project and, when applicable, included within the organization's knowledge base, to be shared and used to promote current and future project performance improvement.\nIf an organization uses a defined project management process or method, lessons from an individual project should be communicated to the owners of the process or method, so the process can be improved to benefit other users.\nNOTE A project office is often the owner of project management processes and methods (see 4.5.7)."
    }
  ]
}
