{
  "records": [
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.1 Introduction",
      "subsubtopic": null,
      "content": "PRINCE2 is one of the most widely used methods for managing projects in the world. It is a structured project management method that uses the experience gained from thousands of projects, as well as contributions from countless project sponsors, project managers, project teams, academics, trainers, and consultants.\nPRINCE2 has been designed to be adaptable so that it can be applied to any project, regardless of the project’s purpose, scale, type, organization, geography, or culture. This is achieved by:\n● separating the management of the project from the specialist development activities, such as design or construction, allowing any specialist activities to be integrated into a controlled environment for the project\n● focusing on what needs to be done to manage the project, rather than prescribing how work is done\n● requiring that the method is established specifically for the needs and context of the project by the way it is applied and tailored."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.1 Introduction",
      "subsubtopic": "1.1.1 Purpose of this book",
      "content": "This book is intended for anyone involved in a project that uses PRINCE2, is considering using PRINCE2, or is looking to develop their project management skills. It is designed for the following roles:\n● entry-level project management personnel wishing to learn about project management generally and the PRINCE2 method in particular\n● experienced project management professionals\n● anyone undertaking a PRINCE2 role on a project, such as a project executive\n● PRINCE2 project managers who need a detailed reference source\n● project office managers who have adopted the method for their organization or are intending to do so and require a source of information\n● agile practitioners who wish to use PRINCE2 to establish appropriate project controls for their work\n● any personnel desiring to develop essential project management skills to improve their effectiveness.\nThe official book aims to address some questions frequently asked by those directly involved in project management or in support or other related roles. These questions include:\n● What is expected of me, and what should I expect from others on the project?\n● What project decisions am I expected to make?\n● What information do I need to supply, and what information should I receive?\n● What should I do if things do not go to plan?\n● Who should I look to for support or for direction?\n● How can we apply and tailor the use of PRINCE2 for our project?\nIt is not intended (or possible) for PRINCE2 to cover every aspect of project management. There are two broad topics that are deliberately considered to be outside the scope of PRINCE2: specialist aspects of project work and detailed project management techniques."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.1 Introduction",
      "subsubtopic": "1.1.1.1 Specialist aspects of project work",
      "content": "PRINCE2’s strength is its flexibility and the fact that it is not specific to a particular industry, type of project, commercial model, project lifecycle, delivery method, product development, or engineering practice. PRINCE2 regards these as specialist aspects of the project work and provides a means for them to be fully integrated into the management approaches to be used by the project."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.1 Introduction",
      "subsubtopic": "1.1.1.2 Detailed project management techniques",
      "content": "There are many proven project management techniques that can be used in support of the PRINCE2 method. For example, release planning, user stories, Kanban, timeboxing, retrospectives, critical path analysis, and earned value management. This book highlights various techniques that support the PRINCE2 practices, but they are not documented in detail in this book as they are already described and maintained elsewhere in various bodies of knowledge.\nTechniques are only described in detail if PRINCE2 specifically recommends that particular approach, or the approach is unique to PRINCE2, such as PRINCE2’s planning technique. Alternative (yet equivalent) techniques can be substituted, or additional techniques included if the chosen techniques are explained in the project initiation documentation."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.2 Structure of the official book",
      "subsubtopic": null,
      "content": "PRINCE2 is a project management method composed of five integrated elements: principles, people, practices, processes, and the project context (figure 1.1).\nFigure 1.1 The five integrated elements of PRINCE2\nThe structure of this book is based on these five integrated elements:\n● PRINCE2 principles The principles are the guiding obligations that determine whether the project is genuinely being managed using PRINCE2. There are seven principles, and unless all of them are applied, it is not a PRINCE2 project. The PRINCE2 principles are explained in Chapter 2.\n● People Projects need people, mainly those working on the project and those affected by the project. An understanding of the needs, capabilities, and motivations of the people involved and the relationships between them is crucial to how the project is established and managed. How people are put at the centre of the method is described in Chapter 3.\n● PRINCE2 practices The practices describe essential aspects of project management that must be applied consistently and throughout the project lifecycle. The seven practices explain the specific treatment required of that aspect of project management for the PRINCE2 processes to be effective and why they are necessary. The PRINCE2 practices are covered in Chapters 4 to 11.\n● PRINCE2 processes The seven processes describe the entire project lifecycle, from activities before getting started, through the stages of project delivery, and to the final act of project closure. Each process has checklists of recommended activities and related responsibilities. The PRINCE2 processes are provided in Chapters 12 to 19.\n● The project context The principles, practices, and processes are applied by the people involved to ensure that the method is fit for the project context. How PRINCE2 can be applied to common contexts is outlined in section 1.4.\nAppendix A provides a summary of management products (such as the business case) used in the practices and processes. Appendix B provides a summary of PRINCE2 roles. The glossary summarizes the PRINCE2 defined terms that are used throughout the official book. Throughout this official book, we refer to the organization that commissions the project as the ‘business’."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.3 What is a project?",
      "subsubtopic": null,
      "content": "Key message\nThe five integrated elements of the PRINCE2 method are designed to work together. The practices ensure that the principles are continually applied during the processes in a way that is specific to the project context and consider the relationships and requirements of people within the project team and those outside the project team.\nA key challenge that organizations face is balancing two competing needs, which are:\n● maintaining current business operations, also known as business as usual (such as maintaining profitability, service quality, customer relationships, brand loyalty, productivity, and market confidence)\n● improving or transforming business operations to survive and compete in the future, also known as business change (for example, anticipating and deciding how change can be introduced to the greatest effect).\nAs the pace of change accelerates (whether technological, business, social, or regulatory), and the need to adapt becomes more evident, the focus of management attention is inevitably moving to achieve a balance between business as usual and business change. Projects are a means by which we introduce change, and although many of the skills required are the same, there are some crucial differences between managing business as usual and managing project work.\nDefinition: Project\nA temporary organization that is created for the purpose of delivering one or more business products according to an agreed business case.\nThere are five characteristics of a project that distinguish it from business as usual:\n● Change Projects are the means by which we introduce change.\n● Temporary Projects are temporary in nature. When the desired change has been implemented, business as usual resumes (in its new form), and the need for the project is removed. As projects are temporary, they should therefore have a defined start and a defined end.\n● Cross-functional A project involves a team of people with different skills working together on a temporary basis to introduce a change that will impact others outside the team. Projects often work across the usual functional divisions within an organization and sometimes span different organizations. This frequently causes stresses and strains both within and between organizations (for example, between customers and suppliers). Each has a different perspective and motivation for getting involved in the project.\n● Unique Every project is unique. An organization may undertake many similar projects and establish a familiar, proven pattern of project activity, but each one will differ in a certain way. This can mean a different team, customer, supplier, product, location, or timeframe. All these factors combine to make every project unique.\n● Uncertainty The characteristics already listed will introduce threats and opportunities over and above those typically encountered within business as usual. Projects are riskier than any operational aspects of an organization.\nProjects vary greatly. For example, an organization might undertake an IT project to improve the systems required to manage its business. Another organization might undertake a clinical research project to bring a new drug to market, and another organization might be building a new facility. Furthermore, the environment within which the project is being managed may influence how it is started, delivered, assured, and closed. There may be factors external to the project itself, such as organizational standards, the maturity of the organization, and regulatory frameworks and factors specific to the individual project, such as the industry sector and the geographical locations. PRINCE2 is designed to work for all types of projects in any project environment."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.4 What is project management?",
      "subsubtopic": null,
      "content": "Definition: Project management\nProject management is the application of methods, tools, techniques, and competencies to enable the project to meet its objectives.\nThe five characteristics of a project (1.3) can result in some typical challenges such as:\n● ambiguity regarding who is responsible for what aspects of the project, leading to confusion and a lack of accountability\n● ambiguity or conflict regarding what the project will deliver, costs, and when\n● unrealistic expectations regarding what the project will deliver, costs, and when\n● unavailability of resources or reassigning resources to business as usual activities over project work\n● difficulty in estimating effort, durations, and costs for project work\n● uncontrolled change (sometimes referred to as scope creep)\n● difficulty keeping the project management team and stakeholders informed, engaged, and motivated during the project lifecycle.\nThe purpose of project management is to address these challenges by reducing and managing ambiguity. This is achieved by uniting the involved parties to clarify objectives and working practices. The aim is to control the specialist work needed to create the products required of the project. Project management involves the planning, delegating, monitoring, and control of all aspects of the project and the motivation of those involved to achieve the project objectives within expected performance targets."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.5 The project context",
      "subsubtopic": null,
      "content": "Definition: Performance target\nThe project’s performance target sets the expected success level against which the management of the project will be judged. PRINCE2 includes performance targets for benefits, cost, time, quality, scope, sustainability, and risk.\nPRINCE2 includes seven aspects of project performance to be managed. These are:\n● Benefits Those involved in the project need to be able to answer the question: why are we doing this, and who are we doing it for? The project management team must have a clear understanding of the purpose of the project and what needs to be achieved to justify its investment.\n● Costs As the project develops, there will be many factors that can affect the cost budget available or that may lead to (potential) underspend or overspend against the cost budget. The project has to be affordable.\n● Time When will the project start, when will the key products be delivered, and when will the project finish?\n● Quality Finishing on time and within budget is not much consolation if the result of the project is not as specified or does not work. What is delivered by the project must be fit for purpose.\n● Scope What will the project deliver? There must be agreement on the project’s scope, otherwise the various parties involved may make different assumptions about what is included or excluded. The project management team should not deliver beyond the scope, as this is a common source of delays, overspend, and uncontrolled change (sometimes referred to as scope creep).\n● Sustainability All projects have an impact on their environment, and project management teams need to know the sustainability performance targets for the project work and for the products required of the project.\n● Risk All projects involve risk. But exactly how much risk is the business prepared to take? Without a shared understanding of the business’ risk appetite, the project management team may be too risk-averse or take more risks than the business is prepared to accept.\nPriorities can be established by agreeing on the project’s performance targets. For example, an urgent project may place more importance on time than on other performance targets, such as costs. PRINCE2 helps with setting such priorities by allowing a range to be specified for each performance target in the form of tolerances (see section 2.4). Some performance targets may have a narrow tolerance, yet others may have a broader tolerance. The agreement of performance targets and their tolerances is a prerequisite for exploring options and determining the project approach.\nAll seven project performance targets and their tolerances are used throughout the PRINCE2 method as the basis for control.\nPRINCE2 has been designed so it can work within any context including organizational and commercial context, delivery method, sustainability requirements, and project scale. These common contexts are described throughout this book to illustrate how PRINCE2 can be applied or tailored."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.5 The project context",
      "subsubtopic": "1.5.1 Organizational context",
      "content": "The PRINCE2 method does not assume any specific organizational context. There may be users who specify the desired outputs (referred to as products in PRINCE2), suppliers who will provide the resources and expertise to deliver the products, and business decision-makers who will ensure that the project investment can be justified and remains justified through the project lifecycle. The PRINCE2 method does not require any specific organizational relationships between the users, suppliers, and business decision-makers for the project. The users, suppliers, and business decision-makers may all come from the same organization, or they may be in separate organizations with commercial agreements between them.\nWithin the PRINCE2 method, the business decision-makers come from the organization that commissions the project. The decision-making will be made within the context of the business strategy, objectives, and policies of the organization.\nDefinitions\nBusiness The organization that provides the project mandate and the structure within which the project is governed. Any use of the term ‘business’ within this book specifically refers to this organization.\nUser The organization that will use the project products to enable it to gain the expected benefits. They may be internal or external to the business organization.\nSupplier The organization that provides the expertise, people, and resources required to deliver the products required by the project. They may be internal or external to the business organization.\nCustomer Where there is a commercial relationship between the business and the supplier, the business is regarded as the customer.\nThe project may be part of a programme or portfolio structure, or it may be a standalone project reporting to the business unit’s management structure, as illustrated in figure 1.2."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.5 The project context",
      "subsubtopic": "1.5.2 Commercial context",
      "content": "Figure 1.2 Various project contexts\nFurther guidance on programme management and portfolio management can be found in the companion guides Managing Successful Programmes and Management of Portfolios.\nThe business is also responsible for realizing any benefits after the completion of the project (see section 5.3.1.4).\nThe business may have entered into a commercial relationship with a supplier to deliver products that fulfil the needs of the users as defined in the project’s business case. The organization delivering the project (the supplier) will do so to satisfy a particular need identified by the business (the customer).\nThe business may divide the work into one or more elements, some of which may require suppliers to deliver. Other elements may be delivered by the business itself, for example, an internal department such as IT or facilities. For a supplier, the work to be delivered could be the subject of a legally binding contract, resulting from the procurement process. To deliver this work, the supplier might procure subcontractors itself, further dividing its work into additional elements.\nIn a commercial environment, there may be hierarchies of commercial relationships between suppliers. Rather than a simple customer-supplier relationship involving two organizations, projects might involve multiple organizations covered by multiple contracts. There may be a single customer with a prime contractor, or there may be several customers and several supplier organizations, each of which may have its own business reasons for undertaking the project.\nThe contract between the parties describes how the customer(s) and supplier(s) will collaborate to deliver the project. The rights and duties covered by the agreement will need to be reflected in how the project is managed.\nIn this book, the term ‘customer’ is only used where there is a commercial relationship between the business and the supplier."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.5 The project context",
      "subsubtopic": "1.5.3 Delivery method",
      "content": "The delivery method is the way in which the work of the project is to be delivered. The project may rely on one or more delivery methods to create the required products. Typical delivery methods include:\n● Linear-sequential approach Each of the delivery steps to create the products occurs in sequence, and the product is made available during or at the end of the project (for example, in a construction project where requirements gathering and design occur before construction starts).\n● Iterative-incremental approach This approach is often, but not exclusively, used for product development, where requirements gathering, design, development and/or coding, and testing occur iteratively throughout the lifecycle of the project. This approach is often referred to as an agile approach.\n● Hybrid approach Some elements of the project use a linear-sequential approach, and other elements use an iterative-incremental approach. For example, a linear-sequential approach can be used for the development of the infrastructure for a service. Then, an iterative-incremental approach can be used for the development of the customer service portal for users to access the service.\nPRINCE2 provides the controlled environment for specialist delivery methods. It does not assume or require any specific delivery method. Any approach can be used through the separation of the management of the project and specialist work to produce the project products. Detailed and complementary guidance on working on iterative-incremental projects using PRINCE2 can be found in the PRINCE2 Agile official book."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.5 The project context",
      "subsubtopic": "1.5.4 Sustainability context",
      "content": "The business is likely to have sustainability objectives and commitments that the project needs to adhere or contribute to, which will inform the project’s objectives and how it is established and managed. PRINCE2, addresses sustainability requirements by including sustainability as one of the seven performance targets used to manage the project. Sustainability is also included in the method through the roles (sustainability responsibilities), documentation (such as plans and reports), practices (such as business case), and processes (such as activities to confirm sustainability requirements).\nIn everyday usage of the term, sustainability is often synonymous with the environment, but sustainability can mean different things to different organizations. For some, it may relate to the environmental impact of the project work, while for others it may relate to the whole life cost of the products delivered by the project and their resilience in operations. Some projects may have sustainability as their very purpose, such as the installation of solar panels.\nUnless otherwise specified, this book uses sustainability to mean one, some, or all of the 17 sustainable development goals defined by the United Nations.\nFigure 1.3 UN sustainable development goals"
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.5 The project context",
      "subsubtopic": "1.5.5 Scale",
      "content": "The PRINCE2 method is flexible, so it can be simplified for small or simple projects or expanded for large or complex projects to ensure thoroughness.\nThe perceived scale of a project is relative to the organization. What is considered a small project in a large multinational enterprise could be bigger than what is considered a large project in a small organization. It is usually more helpful to think of projects in terms of simple rather than small and complex rather than large. Generally, it is a case of how the business perceives the risk and the importance of the project, relative to its business as usual operations.\nPRINCE2 can be tailored to the scale of the project via the:\n● governance arrangements between the business layer, the project board, the project manager, and the teams\n● choice of which project roles are appointed to individuals from the user, business, and supplier organizations (for example, combining roles in simple projects and dividing roles in complex projects)\n● formality and level of detail of project documentation (in PRINCE2 these are referred to as management products)\n● formality of the project controls (for example, frequency of reporting and reviewing)\n● selection and integration of the management approaches, such as a commercial management or change management approach\n● number of stages and work packages the project is divided into\n● setting of the project performance targets and their tolerances."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.6 Features and benefits of PRINCE2",
      "subsubtopic": null,
      "content": "As PRINCE2 is flexible and based on proven principles, organizations adopting the method as a standard can substantially improve their organizational capability and maturity across multiple areas of business activity, such as business change, construction, IT, mergers and acquisitions, research, and product development.\nIn addition to being an established method and qualification used worldwide, PRINCE2 has the following benefits:\n● Proven based on established and proven practice and governance for project management\n● Universal can be applied to any project, of any scale, and easily implemented alongside specialist, industry-specific models (such as engineering models or development lifecycles)\n● Flexible can be tailored to meet the specific needs of the organizations involved\n● Common language and concepts widely recognized and provides a common vocabulary for all participants, which encourages consistency and the ability to reuse project assets, facilitate staff mobility, and reduce the impact of personnel changes or handovers\n● Outcome-focused ensures that project participants focus on the viability of the project in relation to its business case objectives, rather than simply seeing the completion of the project as an end in itself, which ensures that stakeholders (including sponsors and resource providers) are properly represented in planning and decision-making\n● Increased organizational maturity promotes learning from project experience and continual improvement in organizations\n● Part of an integrated suite of methods designed to work with other PeopleCert guides on programme management, portfolio management and risk management."
    },
    {
      "topic": "CHAPTER 1 INTRODUCTION",
      "subtopic": "1.7 Example scenarios",
      "subsubtopic": null,
      "content": "There are four example scenarios used throughout this guide, which demonstrate how the PRINCE2 method can be applied to a wide range of projects. A short summary of each scenario is provided below. Some of the scenarios feature projects at an early stage in their development, whereas others are partway through the project lifecycle. The following icons represent each of the scenarios that appear throughout the guide.\nScenario 1: Data Knowledge\nData Knowledge is a company with the mission of leveraging the power of big data through advanced data analytics solutions. By analysing the wants, needs, desires, and frustrations of social media users, Data Knowledge can transform raw and unstructured data into reliable predictions that enable organizations to utilize consumer behaviours and insights.\nHowever, they have not been as effective in using data to their own advantage, now that the company has over 300 staff. In fact, the head of the data science division raised concerns in the last senior leadership team meeting. The concerns were regarding the lack of visibility of who is working on what projects, poor capacity planning, and claims of an overworked team with low morale due to the constant juggling of commitments and firefighting issues.\nAs a way of addressing this, the data science division has been authorized to start a project to develop a time-recording solution and a set of reports on project and task assignments along with resource utilization and capacity planning. The reports are expected to offer interactive and real-time insights that can enable data-driven decisions around the utilization and planning of resources.\nData Knowledge has a defined framework for the management of projects. This is expected to be a simple business change project, taking no more than three months in the current financial year to complete.\nSince Data Knowledge has in-house data analysis and app development capabilities as well as clear requirements for this project, the project will be led by the head of data science. They will work with the development division in an iterative and incremental approach. This is to ensure that the solution can be deployed quickly to several new projects and enhanced during its roll-out to the rest of the business.\nThe high-level project plan is as follows:\nStage 1 (initiation)\n● product backlog\n● minimum viable product definition\nStage 2\n● timebox 1\n● prototype of time-recording application\n● mock-up of resource management reports\n● timebox 2\n● first release of time-recording application and reports (must-have features)\n● pilot\n● timebox 3\n● enhancements following pilot\n● timebox 4\n● demonstration\n● roll-out\nStage 3\n● product backlog (following roll-out)\n● closure.\nThe main output from the project is to be a time-recording application and set of resource management reports available to all business units.\nScenario 2: Louistown City Council\nLouistown is a historical town which is home to over 40,000 residents and attracts over 20,000 visitors per year. The city council has been criticized for the lack of investment and modernization of the town centre.\nThey have recently decided to improve the vibrancy of the area and offer increased opportunities for business by approving the funds for the ‘Louistown is Open for Business’ (LOB) portfolio. This is an ambitious portfolio of projects covering the next five-year plan cycle.\nA new shopping centre, provisionally named ‘LouisShopping’, is seen as a key project within this portfolio. This is a complex infrastructure project due to the:\n● location of the building and historical nature of the surrounding buildings\n● requirement for the design to be consistent with the environment while offering modern facilities supported by the latest technology\n● need to include underground parking space\n● importance of minimizing disruption to residents and businesses during the construction works\n● recent award of ‘green town’ status to Louistown, and the sustainability requirements this will impose on the development.\nDue to the nature of the work, in which just the construction element is likely to span over two financial years, the council has approved the strategic business case, the initial high-level project plan and has appointed BuildyBrick as the main contractor. They have established a requirement for a traditional delivery method in line with their standard approach to projects. The general view is that this project is long overdue, and the council would like ‘LouisShopping’ to be open to the public by the end of financial year three.\nThe project has just completed the initiation stage and commenced the first delivery stage (stage 2). The high-level project plan is as follows:\nStage 1 (initiation)\n● strategic business case and high-level project plan approval\n● appoint contractor\nStage 2\n● design\nStage 3\n● site preparation\n● utilities and systems\n● construction\nStage 4\n● testing\n● inspections\nStage 5\n● demobilization.\nThe main output from the project is a shopping centre constructed and ready to open to the public.\nScenario 3: Findef\nFindef was formed eight years ago with the promise to revolutionize how businesses identify fraudsters, to protect the reputation of businesses, and to minimize financial risks. The company experienced substantial growth in the first few years, transforming from a niche small-medium-enterprise (SME) to one of the leading fintech firms in the field of financial fraud, working with the world’s largest banks and merchants. In the last 18 months, Findef’s growth has stagnated. This factor, coupled with the arrival of new competitors, is creating discomfort among some investors.\nIn response, the leadership board recently approved the development of a suite of three innovative cybersecurity products that will transform the market in financial risk management. Additionally, the leadership board agreed that Findef will change its commercial and operating models to exploit the new products to their full potential. The company will now deal directly with the end user rather than through banks and merchants.\nThe FindefTwo programme has been established to oversee both the business transformation and the development of the new products. As the programme requires fresh investment, the board has established an investment committee that funds and oversees the programme.\nThe project for the product development will use a hybrid approach of linear-sequential for the overarching design and deployment of the product set and iterative-incremental for the development of each product. The project also includes upskilling Findef’s DevOps team in a new development platform. To mitigate some risks, the project includes procuring advisors and a marketing agency that could validate assumptions and share their product experience with the company.\nThe project is at the beginning of stage 3. The high-level project plan for the product development project is as follows:\nStage 1 (initiation)\n● business case, project initiation documentation\nStage 2 (high-level design)\n● request for proposals (advisor, marketing agency, training), contract awards\n● product design (product family architecture)\nStage 3 (detailed design)\n● product design: product 1\n● early market testing\n● DevOps upskilling\nStage 4 (MVP product 1)\n● iterative-incremental development and soft launch of product 1 to minimum viable product (MVP)\n● product design: product 2, product design: product 3\nStage 5 (MVP products 2 and 3)\n● product 1 ready for full launch\n● iterative-incremental development and soft launch of products 2 and 3 to minimum viable products (MVP)\nStage 6 (first launch)\n● transfer product 1 to BAU support\n● product 2 ready for full launch, product 3 ready for full launch\nStage 7 (second launch)\n● transfer product 2 to BAU support, transfer product 3 to BAU support\n● closure.\nThe main output from the project will be three products ready for full launch and transferred to BAU for operations and maintenance.\nScenario 4: NowByou\nNowByou is a not-for-profit organization that works with local communities to eliminate discrimination of any kind and help advance the international human rights system through local and targeted interventions.\nNowByou forms, chairs, and equips networking and support groups, where anyone who has experienced discrimination can share their experiences and thoughts in a safe and empowering space. Additionally, NowByou is one of the few non-governmental organizations (NGOs) in the country that works directly with police forces to co-develop campaigns that encourage the reporting of discriminatory incidents to authorities.\nRecent research has shown that discrimination against marginalized groups, particularly the homeless and refugees, is growing at a concerning rate. The increase in discrimination has led NowByou to believe that a new six-month campaign is required to address this issue.\nThey have decided to run the campaign as a project, aiming to both raise awareness of this type of discrimination and reinforce their own brand recognition (as NowByou is highly dependent on the goodwill of donors and financial aid from partners).\nThe project management maturity of the organization is very low, with no standardized processes or templates in place. For that reason, NowByou has contacted a professional project manager with a track record of successful delivery in the not-for-profit sector who will be responsible for:\n● developing the initial project management documentation\n● advising and coaching the NowByou director of campaigns, who is sponsoring the project\n● mentoring the staff member who will be appointed as project manager\n● advise the project team how to use a variety of media (tv, press, and social networks) for this, and other future projects.\nThere is a high-level view of the project, but this is to be confirmed, as pre-project discussions are still occurring:\nStage 1 (initiation)\n● business case\n● project initiation documentation\nStage 2\n● campaign high-level requirements gathering\n● options analysis\nStage 3\n● implementation of chosen option(s)\n● closure.\nThe main output from the project will be a delivered multi-channel campaign."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": null,
      "subsubtopic": null,
      "content": "Definition: PRINCE2 principles\nThe PRINCE2 principles are the guiding obligations that determine whether the project is genuinely being managed using PRINCE2 and ensure effective application and tailoring of PRINCE2 to any project.\nPRINCE2 is suitable for every project, regardless of type, size, complexity, importance, level of risk, or delivery method (linear-sequential, iterative-incremental, or hybrid). Moreover, it can be used for all types of organizations, whether commercial, governmental, non-profit, or not-for-profit. Additionally, it is applicable for projects anywhere in the world, with its ability to incorporate country-specific regulations, business models, and cultures.\nTo enable PRINCE2 to be used for such a wide range of projects, the method is flexible in how it can be used for any given project. Rather than prescribing what to do to align the method to the specific project, PRINCE2 offers guidance through principles. These principles enable the project management team to decide how PRINCE2 will be used on their project.\nThe seven PRINCE2 principles are:\n● ensure continued business justification\n● learn from experience\n● define roles, responsibilities, and relationships\n● manage by stages\n● manage by exception\n● focus on products\n● tailor to suit the project.\nHow the method is applied and tailored depends on the nature of the project and factors internal and external to the business as shown in figure 2.1."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.1 Ensure continued business justification",
      "subsubtopic": null,
      "content": "Figure 2.1 How to apply and tailor PRINCE2 to a project\nThe seven principles offer flexibility, as they provide guidance on how the integrated elements of the method can be applied and tailored to find the best fit for the project and its context while keeping the integrity of the method. So long as the principles are followed, PRINCE2 is being used effectively.\nKey message\nA PRINCE2 project has business justification sufficient to warrant investment to initiate the project and ongoing investment through to successful completion. If it does not, it should be stopped.\nThere must be a justifiable reason for starting a project, and the justification must remain valid and be revalidated throughout the lifecycle of the project. The business justification drives decision-making to ensure the project remains aligned with the benefits sought and contributes to business objectives.\nOrganizations that lack rigour in business justification may find that projects proceed even when there are few real benefits or when a project has only tentative associations with the business strategy. Poor alignment with business strategy can also result in organizations having a portfolio of projects that have inconsistent or duplicated objectives."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.2 Learn from experience",
      "subsubtopic": null,
      "content": "Compulsory projects, such as those driven by legislation or regulation, still require justification for the chosen approach to ensure it represents the best value for money. All parties involved in the project will need a balance between expected benefits, costs, and risks for them to have business justification for their involvement.\nThe business justification for a project may change; therefore, it is important that what the project is delivering remains consistent with the evolving justification. If continuing with the project can no longer be justified, then it should be stopped and end in a controlled way. Cancelling a project in these circumstances is a positive contribution to the business as the project’s funds and resources can be reinvested in other more worthwhile projects.\nAfter the project is completed, the project should be reviewed to evaluate if the benefits have materialized sufficiently to warrant the final investment and what lessons can be learned from the project.\nBelow are some examples of the application of the ‘ensure business justification’ principle.\nFor a commercial project with one or more customers and suppliers, each party will need to have a clear business justification to undertake the project and to continue with it. The customer may want to enhance market share by introducing a new product. The supplier’s business justification might include non-financial benefits, such as gaining an impressive customer reference for promotional purposes or building experience in applying new technologies.\nFor a co-owned project, such as a governmental project to jointly develop a new IT system across a number of agencies, if the business justification is lost for one or more parties, those parties should consider ending their participation in the project. In this case, the consequences of ending or withdrawing participation in the project, such as contractual obligations, will inform the decision and any approach to prematurely close the project. Throughout the project, each investing party will need to keep monitoring their own business justification to ensure that the project is still worthwhile for them.\nKey message\nA PRINCE2 project team actively seeks, records, and implements improvements as a result of relevant lessons learned from prior projects and throughout the life of the project. It applies them in future projects and shares them for others to apply.\nA common characteristic of projects is that they include an element of uniqueness. This makes projects challenging as the temporary team may not have experience of a project quite like the one being undertaken.\nTo overcome these challenges, project teams need to find ways to learn from the experience of others and from the experience gained from the project as it develops.\nLearning from experience occurs throughout the lifecycle of the project:\n● When starting a project Previous or similar projects should be reviewed to see if lessons could be applied. If the project is a ‘first’ for the people within the business or if there is any content which is new or novel, then it is even more important to learn from others. This could include projects delivered by people or organizations external to the business to identify relevant lessons.\n● As the project progresses The project team should continue to learn. Lessons should be included in relevant reports and reviews and included at the end of each stage. The goal is to seek opportunities to implement improvements during the life of the project. The retrospective technique is an example of gathering lessons in agile approach.\n● As the project closes The project team should share the insights gained during the project.\nThe foundation for learning is data and the ability to gain insights from it. Projects should be clear about what data is required, how it will be analysed so that insights can be gained and applied, and what will happen to the data during the project and when the project closes.\nProject teams need to consider how to effectively share lessons with all those involved in the project, as people may have different learning needs and preferences. Some may learn best by observing, whereas others do so by experimenting.\nIt is important to learn from both mistakes and successes to continuously improve and innovate. It is the responsibility of everyone involved with the project to identify lessons rather than wait for someone else to do so. Lessons that are not used to improve the project, or future projects, are only ‘lessons identified’ and not actually ‘lessons learned’.\nBelow are some examples of applying the ‘learn from experience’ principle.\nIn a smaller project with one co-located team, ‘lessons learned’ can be discussed on a regular basis in team meetings. Learning in this case happens on the job, potentially on a daily basis.\nIn a large and complex project, the learning process will involve many project team members who could be spread across multiple teams and locations. This large-scale approach will make it harder to ensure everyone has access to the same learning experience.\nLearning in larger projects may require more advanced communication, such as explanatory videos, presentation kits for project team managers, or tailored workshops in subgroups. Such projects may benefit from field trips, pilots, simulations, or go-live rehearsals as a source of learning too."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.3 Define roles, responsibilities, and relationships",
      "subsubtopic": null,
      "content": "Key message\nA PRINCE2 project has defined and agreed roles and responsibilities within an organization structure that engages the business, user, and supplier stakeholder interests. Moreover, a PRINCE2 project management team initiates and builds relationships with and between internal and external stakeholders.\nProjects need people. It is important that the right people are involved, and they know what is expected of them and what they may expect from others in the project. Successful projects require an understanding of the relationships with and between stakeholders and ongoing activities to strengthen them. This is why ‘People’ is one of the five integrated elements of PRINCE2.\nStakeholders can be individuals or groups within or external to the business. Stakeholders within the business could be a work council, sustainability board, diversity board, owners, department leaders, or other project teams; stakeholders outside the business could be trade unions, customers, suppliers, communities, interest groups, banks, or the media.\nAll projects have the following primary stakeholders: the business, users, and suppliers (see section 1.5.1). All three stakeholder interests need to be represented effectively in the project management team; this is reflected in the design of a PRINCE2 project board (see section 6.2.1).\nDefining roles and responsibilities is particularly challenging as projects are cross-functional, may involve more than one organization, often have a mix of full and part-time resources, and may be spread across multiple locations. The management structures of the parties involved in the project are likely to be varied, with different priorities, objectives, and interests to protect. The day-to-day line management structures of the business may not be designed for, or suited to, project work.\nThe assignment of roles to individuals throughout the life of the project and their responsibilities must be clear, unambiguous, and accepted. To be successful, projects must have an explicit project management team structure consisting of defined and agreed roles and responsibilities for the people involved in the project. Moreover, the projects must have an understanding of the relationships and a means for effective communication between them.\nThe goal is to clearly articulate roles and responsibilities to provide a clear, coherent structure that all stakeholders understand and is suitable to enable effective project delivery performance against the project performance targets.\nBelow are some examples of applying the ‘define roles, responsibilities, and relationships’ principle.\nIf the project is part of a programme, then some of the project responsibilities may be held by people in the programme management team. In this case, the programme’s business change manager (BCM) may undertake the project executive or senior user role on the project board to help align the project with the programme. The programme management office (PMO) could provide project support, or the programme’s design authority could be given decision-making responsibility for authorizing changes at the project level. Agreements need to be made about who accepts which project role and the authority and responsibility they each have. The goal is to enhance consistency and coherence between the project and the programme.\nThe nature of the project will determine the number of stakeholders and the amount of change it creates for each of them. A project with a small number of stakeholders and a high degree of impact will have a very focused approach to engaging with them, perhaps on an individual and personal basis. A project with a large number of stakeholders and a wide range of impacts may have to use multiple approaches with a mix of personalized engagement and more general engagement through surveys and broadcast channels (such as emails).\nFor projects that have development teams using agile development methods, the PRINCE2 team manager role may be held collectively by the development team."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.4 Manage by exception",
      "subsubtopic": null,
      "content": "Key message\nA PRINCE2 project establishes limits of delegated authority by defining tolerances for performance against its plans.\nDefinition: Tolerance\nThe permissible deviation above and below the plan’s target for benefits, cost, time, quality, scope, sustainability, and risk without needing to escalate the deviation to the next level of management. Tolerance is applied at project, stage, and team levels.\nPRINCE2 enables appropriate governance by defining distinct responsibilities for directing, managing, and delivering the project and clearly defining accountability at each level.\nAccountability is established by:\n● delegating authority from one management level to the next by setting tolerances against the seven aspects of performance (benefits, cost, time, quality, scope, sustainability, and risk) for the respective level (project, stage, team)\n● establishing controls so if tolerances are forecast to be exceeded, they are flagged as being an exception and immediately escalated to the next management level for a decision on how to proceed\n● establishing an assurance mechanism so that each management level can be confident that the exception controls are effective.\nThe seven aspects of a plan’s performance requiring tolerances to be defined are:\n● Benefits The degree to which it is permissible to underdeliver or overdeliver benefits; for example, the business case for a sales improvement project modelled with a plus or minus two percent range of increased income generation.\n● Costs The degree of permissible overspend or underspend against an agreed budget (both personhours and financial).\n● Time The degree to which it is permitted to deliver earlier or later than an agreed target completion date compared to the project plan, stage plan, or work package description.\n● Quality How much something can vary from agreed acceptance criteria; for example, a project to produce a new sports watch might have a target that the watch should work underwater to a depth of 50 metres with a permissible tolerance of plus or minus five metres.\n● Scope Permissible variation of the plan’s products; for example, a project requiring delivery of all the must-have mandatory requirements but permitted to deliver only 60 percent or more of its shouldhave and could-have requirements.\n● Sustainability The degree to which the project product or project activities required to deliver the project can vary from sustainability targets; for example, a new production line that operates within five percent of an emissions target and was delivered using around 70 percent of workforce coming from the local community.\n● Risk Limits on the plan’s aggregated risks; for example, a tolerance that the cost of aggregated threats must remain less than 10 percent of the agreed budget and that the cost of any single threat must be no more than five percent of the budget.\nThe implementation of ‘manage by exception’ provides for efficient use of senior management time as it reduces senior managers’ time burden without removing their control. This ensures that decisions are made at the right level in the organization. The goal is to alert the next management level in the project as early as possible that the work will move outside of agreed tolerances, and a decision is needed on if and how to proceed. The decision-maker can decide to accept the deviation and its consequences or act to remove or reduce it.\nA project using an iterative-incremental delivery method with defined timeboxes will typically fix time and cost and vary in scope. In this case, time and cost will have much tighter tolerances set than the scope.\nAn example of applying the ‘manage by exception’ principle is that the use of tolerances will differ depending on the project’s context, such as a project with a commercial arrangement between customer and supplier where the tolerances will be reflected in the contract. In this example, if the project manager learns that procured materials will be delivered late and the issue cannot be resolved within the tolerances, the project manager will need to alert the project board quickly. The contract may define any cost remedies available between the customer and supplier, but there may be consequences for the project’s stakeholders caused by the delay. In this case, the project board will need to decide what actions to take and provide direction to the project manager. By reviewing the tolerances at the end of every stage, the project is able to adapt and modify the next stage activities to reflect a changing operating environment."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.5 Manage by stages",
      "subsubtopic": null,
      "content": "Key message\nA PRINCE2 project is planned, monitored, and controlled on a stage-by-stage basis.\nDefinition: Stage\nThe section of a project that the project manager is managing on behalf of the project board at any one time.\nThe focus on managing by stages ensures that the project is properly initiated before work starts on delivery of the project’s outputs. Every PRINCE2 project should have at least two stages: an initiation stage and one further stage. Many projects benefit from having more than two stages.\nAdvantages of managing by stages are:\n● It enables adaptability to changes in the project or business context.\n● It provides review and decision points, giving the project board opportunities to assess the project’s viability at defined intervals rather than let it continue in an uncontrolled manner.\n● It provides the ability to ensure that key decisions are made prior to the detailed work needed to implement them.\n● It allows clarification of what the impact will be of an identified external influence, such as the organizational budget setting process or the finalizing of legislation.\n● It facilitates the principle of manage by exception by delegating authority to the project manager at each stage.\nThe choice of appropriate stages for a project will depend on a number of factors (see 7.2.3), including:\n● minimizing risk exposure through the project lifecycle\n● the size and complexity of the project (shorter stages offer more control, whereas longer stages reduce the effort for senior management)\n● any significant decisions and control points required during the project’s lifecycle; these will often be linked to key investment, business, or technical decisions\n● sector or business policies and standards.\nThe project board authorizes one stage of the project at a time and delegates the authority for day-to day control of the stage, within agreed tolerances, to the project manager. As long as the stage is forecast to remain within tolerance, the project manager is authorized to make adjustments as required. The project board only authorizes the next stage if there is sufficient business justification and funds to continue. If the project no longer has a valid business case, the project board will determine whether and how to recover the project or prematurely end it.\nAn example of applying the ‘manage by stages’ principle is when teams work in ‘sprints’ or ‘timeboxes’ while operating incrementally and iteratively to realize the agreed features and user stories. PRINCE2 can be tailored to work with sprints and user stories instead of work packages and product descriptions. The project manager will define how many sprints are required for each stage. In this way, the project is consistent with the principle of manage by stages."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.6 Focus on products",
      "subsubtopic": null,
      "content": "Key message\nA PRINCE2 project focuses on the definition and delivery of products, in particular their user quality expectations and requirements.\nDefinition: Product\nAn input or output, whether tangible or intangible, that can be described in advance, created, and tested. PRINCE2 includes four types of products:\n● Management products Are often documents or information needed to support the management of the project, such as a business case or a plan.\n● Specialist products Are the products that are needed by the user to realize the benefits required of the project.\n● The project product Describes the total output from the project as defined in the project product description (see section 7.3.2.1).\n● External products Are products developed or provided outside of the project’s control but which the project is dependent on, for example, the publication of a new standard.\nSpecialist products will be referred to throughout the book as simply ‘products’, except when a distinction is needed between management and specialist products.\nThe term ‘project products’ refers to the specialist and management products created during the project.\nProjects that focus on what the project needs to produce are more likely to be efficient and avoid waste than projects that focus primarily on the work activity. This is because the purpose of a project is to fulfil stakeholder expectations in accordance with the business justification. Therefore, there must be a common understanding of the products required and the user quality expectations for them.\nThe purpose of a project can be interpreted in many different ways, unless there is an explicit understanding of the products to be produced and the criteria against which they will be individually approved. PRINCE2 requires projects to be output-oriented rather than work-oriented. PRINCE2 calls these outputs ‘products’.\nThis focus on products:\n● ensures that the project only performs work that directly contributes to the delivery of a product (that is, the project does no more work than it needs to deliver its agreed products)\n● helps manage uncontrolled change (‘scope creep’) by ensuring that all changes are agreed in terms of how they will impact the project products and the business case for the project\n● reduces the risk of user dissatisfaction and acceptance disputes by agreeing (at the start of the project) what will be produced by the project\n● assists a pause or closure of the project. Agreement can be more easily met to pause or close a project after certain products are completed. It also allows easier and controlled resumption of the project.\nAn output-oriented project is one that agrees and defines the project product prior to undertaking the activities required to produce it. The set of agreed products defines the scope of a project and provides the basis for planning and control.\nA PRINCE2 project uses product descriptions that provide the means to determine effort estimates, resource requirements, dependencies, and activity schedules. The focus on products supports almost every aspect of PRINCE2: planning, responsibilities, progress reporting, quality, change control, acceptance, and risk management.\nBelow are examples of applying the ‘focus on products’ principle.\nIn a small simple project, such as publishing a new management book, a single project product description might suffice. This description will determine, among others features, how many chapters will be required, the desired total number of pages, the language, and the number of graphics in colour versus black and white. Product descriptions for projects using an iterative-incremental delivery method, such as agile, may be in the form of requirements, features, epics, and user stories.\nFor larger and more complex projects, the project product description will be divided into sub-products and then further subdivided to a level of detail to understand how each product will be sourced, developed, and approved. The further the products are subdivided, the harder it will be for the project board to be able to decide whether product descriptions are correct. This is because the content becomes more technical and will require specialist knowledge to understand. In this case, it is important that the supplier has the expertise to define the right products at each level, and the business establishes project assurance with the knowledge necessary to assure that the product meets the specification."
    },
    {
      "topic": "CHAPTER 2 PRINCIPLES",
      "subtopic": "2.7 Tailor to suit the project",
      "subsubtopic": null,
      "content": "Key message\nPRINCE2 is applied and tailored to suit the project environment, size, complexity, importance, delivery method, team capability, and level of risk.\nPRINCE2’s value is that it is a universal project management method that can be applied to take account of the project’s context, scale or size, delivery method, stakeholder landscape, complexity, importance, team capability, and level of risk. Furthermore, it can be used for any project type, geography, or culture. It can be used on any project because the method is designed to be applied and tailored to suit each project’s specific needs and context.\nThe purpose of tailoring is to ensure that:\n● the project management method used is appropriate to the project (for example, aligning the method with the business processes that may govern and support the project, such as human resources, finance, and procurement)\n● project controls are appropriate to the project’s scale, complexity, importance, delivery method, team capability, and risk (for example, the frequency and formality of reports and reviews).\nTailoring requires the project board and the project manager to make proactive choices and decisions on how PRINCE2 will be applied. It may also involve adjusting the terminology to match terms used by the organizations involved or replacing some of the PRINCE2 techniques (such as the risk management technique) with alternative procedures such as those already used by the business or supplier(s).\nWhen tailoring PRINCE2, it is important to remember that effective project management requires information (but not necessarily documents) and decisions (but not necessarily meetings).\nIf PRINCE2 is not tailored, it is unlikely that the project management effort and management approaches would be appropriate for the needs of the project. This can lead to inattentive project management at one extreme, where PRINCE2 is followed without question, or ‘heroic’ project management at the other extreme, where PRINCE2 is not really followed at all.\nThe project manager is responsible for tailoring and will make recommendations having consulted relevant lessons and standards. The project board is accountable and needs to approve the recommendations at the end of the initiation stage and every time there is a proposed change to the management approaches.\nHow PRINCE2 will be applied and tailored for the particular project is captured in the project initiation documentation. This ensures that all those involved in the project understand how PRINCE2 is to be used and how to carry out their responsibilities. Care should be taken that the proposed tailoring is consistent with PRINCE2’s seven principles and that the resultant method retains its integrity.\nAn example of applying the ‘tailor to the suit the project’ principle is where the project has a commercial customer-supplier relationship. The project may need to align the project management processes, practices, and documentation to two or more quality systems, one from the customer and one from the supplier. For example, a supplier may wish to use their in-house product development framework based on an iterative-incremental delivery method using agile management approaches. To avoid potential confusion, the project manager might propose to:\n● map and define terminology between PRINCE2 and the supplier’s agile management approaches\n● add the project team roles of ‘customer subject matter expert’ and ‘supplier subject matter expert’ to the agile team, representing the customer and the supplier respectively\n● add a coach to guide the teams in working effectively in the combination of PRINCE2 and the supplier’s in-house agile method\n● collaborate and communicate according to agile ways of working, such as a daily stand-up and support agile reporting tools, such as information radiators\n● define project procedures, such as working with sprints or work packages, product descriptions, or user stories, and how to use these in the project."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.1 Context",
      "subsubtopic": null,
      "content": "Key message\nThe purpose of a project is to deliver change, which will affect people in their business as usual (BAU) activities, routines, and responsibilities. How well the change is implemented, and therefore how well the project performs, depends on the capabilities of the project team, the strength of the relationships between them, and the people impacted by the change.\nIn PRINCE2, ‘people’ covers those who are working on a project and the relationships between them, as well as those impacted by a project.\nOrganizations are a complex ecosystem of fluctuating relationships. Projects change organizations, regardless of whether or not it is their primary purpose. The success of a project will depend on how well the project establishes strong relationships with the organizations that support its delivery, as well as how it fits into the organizational ecosystem to deliver the change.\nProjects combine a unique set of people from across the business, user, and supplier communities for a limited period of time. To successfully deliver the project, all levels of leadership must establish a project culture that motivates people.\nDecisions should be made close to where the relevant knowledge resides. They should be escalated only if there is a need to consider the impact on other parts of the project ecosystem, the organizational ecosystem, or to manage wider political implications.\nFigure 3.1 Organizational and project ecosystems\nDefinitions\nOrganizational ecosystem The internal elements of an organization (including staff, board, owners, and other stakeholders) together with the organization’s external relationships such as customers, partners, suppliers, regulators, and competitors.\nProject ecosystem Those elements of the business involved in or directly impacted by the project and the associated users and suppliers."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.2 Leading successful change",
      "subsubtopic": "3.2.1 Projects require change management",
      "content": "All projects result in a change in how people, organizations, and systems operate the current state to a future target state that incorporates the use of the project products. Effective leadership is required to deliver this change.\nDefinition: Change management\nChange management is the means by which an organization transitions from the current state to the target state.\nThe current and target states can be captured and described as a set of routines, responsibilities, relationships, cultures, and capabilities.\nIdentifying which areas of the organization will be impacted by the project as it transitions from the current state to the target state describes the change the project will deliver. For some projects, there may be interim states the business will transition through, and these can also be described.\nPRINCE2 addresses change by creating and maintaining a change management approach for the project. In determining the level of detail to capture in the change management approach, it is worth considering:\n● what decisions the change management approach is supporting the project team to make\n● the skills and capabilities required during and after the transition from current to target state\n● which areas of the organizational ecosystem are likely to be impacted by the project\n● the key relationships to be considered\n● the evolving culture\n● how best to transition; for example, through learning or upskilling, transitioning knowledge from the project team, or recruiting new people into the business.\nManagement product: Change management approach\nThe change management approach is part of the project initiation documentation.\nPurpose\nTo establish the target organizational state required for the project to meet its objectives together with the means by which the business will shift from the current state and through any interim states.\nHigh-level content\nScope what changes will be delivered by the project; any exclusions\nChange states description of current, interim, target states\nState characteristics for each state, highlighting those that are changing: for example, routines, practices, process, culture, responsibilities, structure, capabilities\nEnabling activities before transition, during transition, after transition; for example, consultation, trials, training, and helpline\nResources for the enabling activities\nResponsibilities for the enabling activities\nSupporting tools and techniques for the enabling activities; for example, modelling\nStandards any standards that apply to change management activities\nReferences for any associated documents or products."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.2 Leading successful change",
      "subsubtopic": "3.2.2 Stakeholders",
      "content": "Projects will impact people from across the organizational ecosystem. Therefore, a project will need to involve those with a formal role in the project team and key people either impacted by or critical to the success of the project (who may not hold a formal role). These people are the stakeholders in the project and will cover the full spectrum of users, suppliers, and the business. Stakeholders can be external to both the project team and the business.\nDefinition: Stakeholder\nAny individual, group, or organization that can affect or be affected by (or perceives itself to be affected by) the project.\nA strong understanding of the relationships between the project and the organizational ecosystem, and the ability to identify key stakeholders at the interface between the two is fundamental to leading successful change.\nThese stakeholders are the key influencers, who may be the following:\n● senior executives\n● those found in the user, supplier, or wider operational communities within the organization undertaking day-to-day tasks and decision-making\n● those who can be identified by considering the bottlenecks where information, knowledge, and money flow across interfaces (for example, document controllers, technical experts, and commercial managers); and by speaking to people in the areas impacted by the project to find out who holds the knowledge in their area and is best informed on how things will practically work\n● those who can shape the perception of the majority within the project ecosystem\n● these are the people, through their network, who can have the greatest influence on the adoption of the project products and the realization of project benefits\n● taking time to understand their perspectives on the project and any constraints they have will help improve project delivery\n● the people the project management team needs to work closest with to ensure the success of the project.\nStakeholders at the interface with the project may change over time as the project evolves and relationships develop.\nThe way in which a project is established should support relationship building across interfaces. This can be established through regular meetings and working groups that build a shared understanding of different perspectives, the project data, and knowledge agreed on by stakeholders."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.2 Leading successful change",
      "subsubtopic": "3.2.3 Culture",
      "content": "Figure 3.2 The three project interests\nIn figure 3.2 the size of the bubbles can vary. For example, for some projects the majority of the users may sit in the organizational ecosystem. For some projects all the suppliers could fall within the project ecosystem as they are uniquely engaged for the specific project and have no other relationships with the business. Understanding where the business, supplier and user interests sit in each of the ecosystems helps in deciding how they will be represented on the project and how they will be engaged.\nProjects often combine people from different parts of the organizational ecosystem, where different working cultures may exist. A project team may need to establish a project culture that is distinct from the business but in such a way that it remains aligned with the wider organizational ecosystem.\nDefinition: Culture\nCulture is the set of shared attitudes, values, goals, and ways of working that characterize a group of people.\nA shared understanding of the project developed with key influencers must be captured as part of the project brief. This shared understanding of the project combines with an understanding of the external legal and regulatory obligations and relevant business commitments (such as sustainability targets) to provide a guide for multi-layered decision-making.\nBased on the shared understanding developed with the key influencers, it is possible to establish ways of working to ensure all impacted areas of the organizational ecosystem are appropriately involved in the project as it progresses. The ways of working are captured in the management approaches for the project. Gaining a shared understanding is also enabled through who is assigned to project roles (see Chapter 6), including decision-makers on the project board who represent business, user, and supplier interests.\nThe project management team structure and the quality and planning practices in PRINCE2 ensure that users are represented or involved in defining, developing, quality control of products, and consulted in the decision-making process.\nThe shared understanding enables aligned behaviours and sets the culture for the project.\nAt the start of a project, the project culture tends to reflect the organization’s culture. However, a distinct project culture may emerge as it evolves. It is important that the formal ways of working evolve to reflect the emerging project culture and support alignment with the wider organizational ecosystem that the project needs to interact with.\nAs the project progresses, key influencers on a project may change, as do the key relationships. It is important to ensure that the shared understanding of the project remains valid and supports the project’s evolving culture. Project teams should check the shared understanding at the end of each stage of the project and whenever there is a change in key influencers.\nDefined ways of working should remain aligned with how people are actually working. Persistent non-compliance with project processes is often a leading indicator that the agreed ways of working have become unaligned with the emerging project culture. Although it is tempting to assume that non-compliance is because of poor behaviours, there could be an underlying disconnect that is worth exploring. The ways of working should evolve to remain aligned with the desired project culture and with the wider organizational ecosystem which the project interacts with.\nScenario: embedding shared understanding/users inside and outside organization (NowByou example: professional PM used community of practice ('project club') and gradually introduced practices/terminology, adapting to existing culture.)"
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.3 Leading successful teams",
      "subsubtopic": null,
      "content": "Definitions\nCollaboration People from across the project ecosystem working together to achieve the project’s objectives.\nCo-creation A specific form of collaboration involving users and key influencers in the design of products and agreed ways of working to ensure they are adopted by the project and organizational ecosystems.\nLeadership Motivating people to achieve a project’s objectives. On projects, this is best done through collaboration across the project ecosystem, persuading, influencing, and co-creating with a focus on managing key relationships and seeking regular feedback to ensure team members remain aligned to the project’s objectives and agree to joint ways of working.\nManagement Instructing the execution of tasks in line with agreed ways of working. Co-creating ways of working with project team members (and stakeholders) significantly improves people’s willingness to be managed in line with them.\nProjects are delivered by people in a temporary team, typically working across organizational boundaries. As a result, the people assigned to work on projects often have multiple reporting lines. This reporting line can be to a part of the organization that has allocated the person to the project for a limited duration. This can also be to a supplier’s organization where external people provide project skills and capabilities. Sometimes people with specific skills and capabilities are assigned across multiple projects or are assigned to a project on a part-time basis. This creates reporting lines to multiple people.\nTo successfully lead a project team, it is important to be aware of the following:\n● Although a project manager has formal authority within the tolerances set by the project board, the actual power structure that emerges in a project does not always reflect what has been formally agreed.\n● Due to the temporary nature of projects and the multiple reporting lines of people working on the project, project managers often rely on their ability to influence and motivate people through aligned interests and relational skills in addition to establishing the shared purpose of the project.\n● PRINCE2 defines roles that might not align with a person’s job title.\n● Team members often have competing priorities for their time and attention, which may at times conflict with the needs of the project.\n● It is not unusual for members of the project team to be more senior than the project manager, potentially causing hierarchical tension.\n● Some motivational factors may be outside of a project manager’s remit. For example, remuneration and career progression of project team members."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.3 Leading successful teams",
      "subsubtopic": "3.3.1 Leading across organizational boundaries",
      "content": "In addition to those people formally assigned to a project, there are people within the business who are affected by the project, but do not work within the defined project team. They often have a role to play, for example directly contributing to the project through activities such as defining, assuring, and accepting products into the business. They may indirectly contribute by undertaking activities within their area of the business to accommodate or derive benefit from the project, such as upskilling staff, changing ways of working, or integrating new products into their area of the organization.\nWhen these activities are outside of the defined project scope, it is important to ensure that there is a clear understanding of the dependencies on such activities, who is responsible for undertaking them, and how they will be funded and monitored. If this type of work is not managed carefully, projects can be delayed or fail to achieve their benefits.\nLeading people beyond a project’s direct authority (often across organizational boundaries) requires a degree of cultural intelligence. Cultural intelligence is the capability to relate and work across cultures within the organizational ecosystem. Successfully working across cultures requires:\n● teams to adapt and find ways to successfully interface with each other\n● setting clear project boundaries within which people can flex\n● establishing the right conditions for people to succeed\n● awareness of and means to consider the many different perspectives that may exist in the project (such awareness is often referred to as emotional intelligence)\n● awareness of the constraints people work within, including different pulls on their time and attention."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.3 Leading successful teams",
      "subsubtopic": "3.3.2 Building effective teams",
      "content": "An effective team will require a diverse set of capabilities, competencies, and perspectives that match the requirements of the project.\nIdeally, organizations would select the people needed to fulfil each of the required roles, but this is often not possible. It is important to understand the competencies and capabilities of the people recruited or assigned to a project, and ensure any gaps are identified and mitigations established to cover them, such as upskilling or shifting responsibilities for certain tasks to more appropriate people. Even when people technically have the same capabilities and competencies, they are likely to perform the same role differently. Sometimes, the same person may perform differently depending on who they are working with.\nAs temporary organizations, project teams may not have worked together before and may need to quickly discover how to work together effectively. It can help accelerate team building by using structured exercises that focus on building not only self-awareness and self-management but also an understanding of other’s perspectives. This can build trust and find compatible ways of working.\nRoles and responsibilities should reflect the capability, authority, and availability of the individual undertaking the work and should be considered through the lens of their key relationships. They should be reviewed in the event of any shifts in these key relationships and updated accordingly."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.3 Leading successful teams",
      "subsubtopic": "3.3.3 Bringing the team together",
      "content": "An integral part of building an effective team is that team members feel accepted, respected, and able to express diverse viewpoints without fear of negative consequences. All members of a project team are responsible for creating this psychological safety for each other through their day-to-day interactions and by caring for each other’s wellbeing. Team members may also need space to experiment, inspect, adapt, self-organize, and adjust their ways of working.\nPRINCE2 supports building effective teams through the:\n● Project plan This explains the team’s goals to create a clear sense of purpose and provides an ability to answer questions from stakeholders.\n● Project management team structure and the role descriptions These explain the structure of the team and their associated roles, responsibilities, and relationships to support developing key relationships and identifying any coaching or training needs (such as influencing skills and how to handle resistance to the change).\n● Communication management approach This explains how team members will actively engage with and support each other and how relationships will be developed between different groups within the wider project ecosystem.\n● Project initiation documentation This explains the agreed ways of working, empowering the team to remain focused on delivering the project outcomes.\n● Product based planning This approach places great emphasis on getting agreement on what will meet user needs (product description) and also clarifying the dependencies and sequencing of key outputs (products).\nWhether projects are delivered virtually, in person, or through a hybrid approach, the way in which people work with each other needs to be carefully considered, both to optimize the use of people’s time and to build social cohesion. Social cohesion is developed by:\n● people meeting in a purposeful way on a regular basis and building trust across organizational or project silos\n● considering how key relationships will be developed and maintained over the length of the project to build resilience for when inevitable hurdles are encountered\n● considering the benefits of co-locating an office-based project team to facilitate the organic relationship building that occurs during non-structured activities (such as conversations over the desk partition, in the communal kitchen, in corridors between meetings, shared lunches, and social events).\nWhen teams are virtual, located at a distance from each other, or hybrid, building social cohesion may need additional activities such as:\n● syncing co-location days for key people and teams with a focus on building key relationships\n● allowing time for less structured conversations online\n● holding ‘away days’ for virtual teams\n● using virtual collaboration tools to enhance effectiveness and efficiency of virtual ways of working\n● providing opportunities or incentives for people to meet and socialize face-to-face."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.4 Communication",
      "subsubtopic": null,
      "content": "Scenario: bringing the team together/social cohesion\nEveryone involved in the new product development (part of the FindefTwo programme) has been under pressure to deliver the second stage of the project. This is because the programme board wants to complete the high-level design before the next quarterly leadership board meeting.\nAlthough the team managed to deliver on time, this was not without issues. It was found that working across multiple time zones and in virtual teams exhausted individuals, resulting in low team morale.\nThe project manager is aware of this, and before the detailed design starts for product 1, decides to bring the team together for a ‘pause and reflect’ day. This is a full day of team building activities that offer an opportunity to share lessons, re-energize for the upcoming stage, and build social cohesion within the team.\nTo ensure that the unity of the team is not lost after the ‘pause and reflect’ day, certain changes have been agreed. There will be regular project update webinars at different times of day to allow those in different time zones to attend. There will also be a ‘virtual coffee time’ in the internal social network platform, giving members of the team an opportunity to interact with each other informally.\nWhether it is the primary function of the project or a by-product, projects create change in organizations. As such, projects are often subject to high levels of scrutiny and open to misconceptions regarding their purpose and impact. Without a clear approach to communications, this can lead to unnecessary barriers in implementing any changes, as people seek to protect the current situation or to limit the perceived negative impact of the project.\nPRINCE2 addresses communication in a communication management approach.\nManagement product: Communication management approach\nThe communication management approach is part of the project initiation documentation.\nPurpose\nTo define and describe the means and frequency of communication with and receiving feedback from across the project ecosystem, supporting alignment and shaping of the project. It facilitates engagement with stakeholders through the establishment of a controlled and bidirectional flow of information.\nHigh-level content\nScope describes what communication will be managed by the project\nStakeholder analysis identification and analysis of those impacted by the outcome of a project or by the process of delivering the project and those who have the influence to impact the success or failure of the project\nCommunications schedule and procedure(s) for each stakeholder group: purpose, frequency, channels/format, messaging, and so on\nResponsibilities for the communication activities\nResources for the communications activities; for example, public affairs or internal communications\nSupporting tools and techniques for the communication activities; for example, communications platforms or tools for analytics or automation\nStandards any standards that apply to communication activities; for example, public engagement standards and ethical standards\nReferences for any associated documents or products.\nA communication management approach is equally about listening as it is about broadcasting. It seeks to understand the perceptions and concerns within the project ecosystem so they can be addressed before they become more significant risks. This also allows messaging to be tailored to the concerns and interests of different groups within the project ecosystem and the wider organizational ecosystem.\nGeneric messaging is rarely effective, as people obtain information from a variety of channels. Identifying and working with key influencers from the user, supplier, and business stakeholder groups helps to accommodate different perspectives. This ensures strong feedback loops and the ability to tailor messaging for each of these groups.\nGiven the number of communication channels and how interconnected the digital landscape is, attempting to control the messaging on a project can be challenging. This can be made more manageable by ensuring that key influencers help shape messaging and support communications.\nMost communication within organizations occurs outside of formal channels. Therefore, it is best to accept this and provide information in multiple formats that people can share easily and provide multiple pathways for people to give feedback.\nHow project teams communicate will also depend on whether they are co-located, remote, or hybrid:\n● Co-located teams Information tends to be shared organically through both formal and informal networks. The focus is on:\n● providing information in multiple formats which can be easily shared through these networks\n● monitoring whether information is flowing freely throughout the project ecosystem\n● identifying any team members or groups who are disconnected and working to reconnect them.\n● Remote teams A more deliberate and structured approach is required to ensure information is flowing through the project ecosystem. The focus is on:\n● building in time to allow for unstructured listening and sharing of information\n● seeking clarity on how information is flowing through the project ecosystem and providing information in appropriate formats to facilitate this\n● identifying key relationships and agreeing how they will build both structured and unstructured time together.\n● Hybrid teams Hybrid teams’ means of communication must ensure the project does not develop separate groups who are more involved or less involved because of their location.\nScenario: two team leaders meeting for coffee\nData Knowledge’s iterative approach for the development of a new time-recording solution allows for early feedback to be incorporated. It made the data science team leader and the development team leader realize that they needed to be aligned. They agreed to meet for a coffee every two weeks for a general catch-up in a local park, as they usually met virtually. The company provided coffee vouchers at a central coffee shop, encouraging people to accompany each other for coffee whenever they are in town.\nOn one occasion, the data science team leader was unsure of the level of detail to be captured in the solution and related reports. Specifically, they had to decide if it would be sufficient to record how many hours per project each resource carries out, or if it would also be useful to have that information at the task-level.\nOn one hand, reporting at the task level would give assurance to project managers that the team is allocating their time to priority tasks; on the other hand, reporting at this low level would be a significant cultural change and the staff could be uncomfortable with such level of scrutiny.\nThe two team leaders exchanged ideas over coffee and agreed that reporting at the task-level would be too much. A decision was easily reached to report time at the project level only.\nThe communication management approach is likely to evolve as the project evolves and becomes more defined. For complex projects with a wide impact, it can be useful to develop the project with a smaller group of key influencers in what is sometimes referred to as a ‘quiet phase’.\nA ‘quiet phase’ will keep wider communications to a minimum until the project is better defined and minimize the spread of misinformation or rumours (this is especially important when a project is politically sensitive and may be of interest to the general public).\nIt is insufficient to rely solely on periodic reporting to determine how a project is progressing. Reporting can be subject to bias as people might subconsciously manipulate information based on what is considered acceptable, expected, or desirable.\nAn open and transparent environment can reduce the level of bias. However, it is important to have additional pathways to obtain feedback in the project, such as building strong relationships with key influencers and monitoring the health of key relationships within the project ecosystem.\nPockets of resistance to the project are a useful indicator of where communications should be focused. In taking the time to listen to the concerns raised, misconceptions can be identified, and issues can be addressed."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.5 People are central to the method",
      "subsubtopic": null,
      "content": "Scenario: concept of quiet phase\nIt is no surprise that LouisShopping is likely to cause some disruption to residents and businesses during the construction works. To minimize the risk of incorrect information being shared and rumours spreading, the project team has decided to contain wider communications to a minimum until the project is defined. Following this, BuildyBrick established a full communication strategy.\nFor that purpose, the project team has invited key influencers from the local neighbourhood to join a monthly communication planning meeting. Together, these selected influencers will suggest ideas and work closely with the project team on the communication messages, formats, and vehicles to use when the time comes to communicate a clear message to the local community.\nThis chapter explains three people-focused activities: leading successful change, leading successful teams, and communication.\nThese are not standalone activities as they influence all aspects of project management. As illustrated in figure 3.3, leading successful change, leading successful teams, and communication are central to the PRINCE2 method.\nPRINCE2 is a project management method composed of five integrated elements: principles, people, practices, processes, and the project context. The following sections explain how the principles, practices, and processes address the people factors explained in this chapter.\nFigure 3.3 People central to the method"
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.5 People are central to the method",
      "subsubtopic": "3.5.1 People and PRINCE2 principles",
      "content": "PRINCE2 is based on seven principles, one of which is that all PRINCE2 projects must define roles, responsibilities, and relationships. This ensures people factors are continually addressed throughout the project’s lifecycle.\nPeople factors permeate the other principles as illustrated below.\nEnsure continued business justification\n● Organizations are fundamentally a collection of people interacting with each other around the core purposes of that organization. The business justification for a project needs to satisfy all three project interests: user, business, and supplier. Defining a project that aligns all of these interests can take time and effort. Therefore, it is important to consider the dynamics of the key relationships relating to these interests, as they impact how agreement is reached and determine whether the project continues to be valid. Moreover, it is crucial to recognize that what is considered justification may change when roles change.\n● Business justification can be perception-based, so the communication management approach is a key enabler to ensure ongoing perceived business justification by managing key relationships and showcasing progress to demonstrate value.\nLearn from experience\n● There is significant value in learning from visible knowledge, such as business books and captured learning, but there is valuable knowledge hidden within a project ecosystem. This requires a collaborative environment that encourages knowledge sharing throughout the lifetime of a project. Knowledge sharing enables people to benefit from each other’s experience.\n● In particular, people factors such as behaviours, culture, and relationships are difficult to document and are best learned through social learning. For example, team members connecting and learning from people who have worked on an earlier stage or other projects with similar characteristics.\nManage by stages\n● The stages of a project often mark a change in the influencers and any key relationships. They are good points to review how the project is planned to deliver, ensuring it remains aligned with how people interact with each other and the wider organizational ecosystem. Stage boundaries often mark a transition in the organizational design (see Chapter 6).\n● Stage boundaries provide a more controlled way to review the skills needed for the next delivery stages and make changes, even to the Project Board. It is better to have the right people managing the project rather than people who are unable to effectively contribute.\nManage by exception\n● Decisions should be made at the most local level where the knowledge needed to make and own those decisions resides. Decisions should be progressed through the levels when a decision has the potential to impact other areas of the project. Therefore, it requires different perspectives to be considered, or it will have a wider impact outside of the project boundaries.\n● The extent of delegation is often dependent on the level of confidence and trust that exists in the key relationships and will adapt over the life of a project in response to the skills and capabilities of individuals. Improving confidence and trust improves the ability to manage by exception.\nFocus on products\n● Co-creating products, with agreed product descriptions, with the business, user, and supplier communities unites their different perspectives. This improves the development and adoption of the products into the business, reducing handover risks and ensuring that operational and maintenance issues are fully considered.\nTailor to suit the project context\n● Tailoring supports the ability to adapt the PRINCE2 method to the people and organizations involved, rather than attempting to adapt them to the method.\n● Tailoring is based on the level of capability or project management maturity, which will evolve over time as people gain a better understanding of PRINCE2 principles, practices, and processes."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.5 People are central to the method",
      "subsubtopic": "3.5.2 People and PRINCE2 practices",
      "content": "PRINCE2 defines seven practices (see Chapter 4) that are essential aspects of project management that must be applied continually and in parallel throughout the life of the project. The ‘organizing’ practice explains how people organize within a temporary project management team. In this way, it ensures that the interests of the user, supplier, and business are represented in the project and establishes the design and development of the project organization.\nPeople factors are represented in all the practices. For example, the development of the business case requires multi-layered perspectives from across the organizational ecosystem (business, user, and supplier communities). This is to provide clarity regarding the project’s purpose and enable a common understanding to develop across the project team."
    },
    {
      "topic": "CHAPTER 3 PEOPLE",
      "subtopic": "3.5 People are central to the method",
      "subsubtopic": "3.5.3 People and PRINCE2 processes",
      "content": "The PRINCE2 processes are organized into four layers: business, directing, managing, and delivering. People factors such as behaviours, culture, and relationships are included in the processes, explaining how people interface between the layers (see Chapter 12)."
    },
    {
      "topic": "CHAPTER 4 INTRODUCTION TO PRINCE2 PRACTICES",
      "subtopic": "4.1 The PRINCE2 practices",
      "subsubtopic": null,
      "content": "Definition: Practice\nAn aspect of project management that must be applied consistently and throughout the project lifecycle. The practices require specific treatment of that aspect of project management for the PRINCE2 processes to be effective.\nThe PRINCE2 practices describe aspects of project management that must be continually addressed as the project progresses through its lifecycle. For example, the business case for the project must be updated and revalidated throughout the project lifecycle as issues will occur, and risks need to be managed. The strength of PRINCE2 is the way in which the seven practices are integrated, both in how they link together and are used across all the PRINCE2 processes.\nThe PRINCE2 processes (see Chapters 12 to 19) address the progressive flow of the project (the lifecycle), describing actions relating to each of the practices when they are needed. In the following practices chapters (see Chapters 5 to 11) more detailed guidance is provided for those actions.\nTable 4.1 The seven PRINCE2 practices: Business case (Why? 5); Organizing (Who? 6); Plans (How? How much? When? 7); Quality (What? 8); Risk (What if? 9); Issues (What now? 10); Progress (Where are we now? Where are we going? Should we carry on? 11)."
    },
    {
      "topic": "CHAPTER 4 INTRODUCTION TO PRINCE2 PRACTICES",
      "subtopic": "4.2 Applying the practices",
      "subsubtopic": null,
      "content": "It is expected that the PRINCE2 method will be applied and tailored to ensure it is fit for purpose for the project’s context. This will include the way the PRINCE2 practices are applied. This may range from the business providing standards or prescriptive guidelines to allowing the project management team a large degree of freedom as to how they apply each practice to the project.\nThe PRINCE2 practices are designed to help the project management team apply and tailor the method, principally through a suite of management approaches (such as the benefits management approach). Each management approach defines the procedures, techniques, and standards to be applied and the responsibilities for that aspect of project management to be effective.\nPRINCE2 does not prescribe how procedures, techniques, and standards should be documented, the level of detail required, or how they are published and shared. The level of detail could vary from a few paragraphs to a comprehensive instruction manual. The level and type of documentation is established by the Project Board who will consider what they need to manage and document their decisions within agreed business policies.\nContextual factors such as importance, risk, and urgency of the project will influence the level of control required, which will determine the degree of formality and frequency of monitoring, reviewing, reporting, and decision-making. The organizations involved and the relationship between them (for example, customer and supplier) will also influence the controls that will be established. Whether the project is part of a wider programme or portfolio will influence how the project management team interacts with the business and incorporates their management requirements. When applying the PRINCE2 practices, project management teams should also reflect any tailoring of the roles, processes, and terminology.\nAll seven practices should be applied in a project. However, they vary according to the scale, risk, the people and organizations involved, and the complexity or simplicity of the project concerned. This will always ensure that the method remains consistent with the seven PRINCE2 principles.\nThis book contains suggestions for how each practice can be applied to the project’s context based on some common factors, such as a project in a programme or a project using an agile delivery method."
    },
    {
      "topic": "CHAPTER 4 INTRODUCTION TO PRINCE2 PRACTICES",
      "subtopic": "4.3 Management products",
      "subsubtopic": null,
      "content": "PRINCE2 management products describe the information that will be required to manage the project. This information can be maintained in a variety of ways, possibly as documents or part of a management information system. Appendix A contains suggested outlines of each PRINCE2 management product and further details about how the management products can be tailored.\nThere are two management products that are relevant to the majority of the PRINCE2 practices that are described in this chapter: the project initiation documentation and project log."
    },
    {
      "topic": "CHAPTER 4 INTRODUCTION TO PRINCE2 PRACTICES",
      "subtopic": "4.3 Management products",
      "subsubtopic": "4.3.1 Project initiation documentation",
      "content": "The project initiation documentation comprises the package of information developed and compiled during initiation to gain authorization to proceed with the project. It provides the basis for its ongoing management. It contains a wide range of information that could be captured in separate documents or systems. Alternatively, all the information could be gathered to form a single reference document.\nManagement product: Project initiation documentation\nPurpose: The project initiation documentation gives the direction and scope of the project and (along with the stage plan) forms the ‘contract’ between the project manager and the project board.\nThe three primary uses of the project initiation documentation are to:\n● ensure that the project has a sound basis before asking the project board to make any major commitment to the project\n● act as a base document against which the project board and project manager can assess progress, issues, and ongoing viability questions\n● provide a single source of reference about the project so that people joining the ‘temporary organization’ can quickly and easily discover what the project is about and how it is being managed.\nHigh-Level content:\n● Project definition explains what the project needs to achieve and should include: background context, project objectives and desired outcomes, project scope (inclusions and exclusions), constraints and assumptions, the user(s) and any other interested parties, and interfaces\n● Project approach defines the choice of solution and delivery method that will be used in the project to deliver the business option selected from the business case, considering the operational environment into which the solution must fit\n● Business case describes the justification for the project and the selected business option based on estimated costs, risks, and benefits\n● Project management team structure a chart showing who will be involved with the project\n● Role descriptions describe the roles of those in the project management team\n● Management approaches the procedures, techniques, and standards to be applied and the responsibilities for: change management, benefits management, commercial management, communication management, data management, issue management, quality management, risk management, and sustainability management\n● Project plan describes how and when the project’s objectives are to be achieved by showing the major products, activities, resources, and people required on the project; provides a baseline against which to monitor the project’s progress\n● Tailoring of PRINCE2 a summary of how PRINCE2 is tailored for the project; for example, any changes of terminology.\nThe project initiation documentation is a living product in that it should always reflect the current status, plans, and controls of the project. Its component products will need to be updated and re-baselined, as necessary, at the end of each stage to reflect the current status of its constituent parts. The version of the project initiation documentation that was used to gain authorization for the project is preserved as the basis against which performance will later be assessed when closing the project.\nThe components of the project initiation documentation are described in more detail throughout the practice chapters (Chapters 5 to 11). However, at the end of every stage, each component of this documentation is reviewed for currency, and if required structured changes should be made. The baseline version is always preserved."
    },
    {
      "topic": "CHAPTER 4 INTRODUCTION TO PRINCE2 PRACTICES",
      "subtopic": "4.3 Management products",
      "subsubtopic": "4.3.2 Project log",
      "content": "The project log maintains a live record of project activities and progress. The project log captures a wide range of project activities and progress information, such as issues and risks.\nManagement product: Project log\nPurpose: The purpose of the project log is to capture the continually changing records of issues, lessons, products, quality, risk, and other formal/informal actions or events. The project log is dynamic in that it contains the current and historic record of project activities and progress.\nHigh-level content:\n● Project logs and registers:\n● issue register\n● lessons log\n● product register\n● quality register\n● risk register\n● daily log of other information actions and events.\n● Common data for each log entry:\n● unique identifier\n● date logged\n● logged by\n● date updated\n● status\n● classification (where needed)\n● details.\nThe project log may be a single document or, more commonly, a collection of separate logs. Each log/register within the project log is described in further detail throughout the practice chapters (Chapters 5 to 11)."
    },
    {
      "topic": "CHAPTER 4 INTRODUCTION TO PRINCE2 PRACTICES",
      "subtopic": "4.4 Format of the practice chapters",
      "subsubtopic": null,
      "content": "Each practice chapter is structured as follows:\n● purpose of the practice\n● guidance for effective use and management of the practice\n● techniques that support the practice\n● for each practice there are two types of techniques: those that are specific to PRINCE2 (for example, product-based planning) and additional techniques that are useful depending on project context. The additional techniques can be omitted or substituted without any need to change how PRINCE2 is applied. Omitting or substituting PRINCE2 techniques would require the method to be tailored\n● applying the practice\n● management products to support the practice\n● focus of key roles for the practice\n● key relationships with the PRINCE2 principles."
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.1 Purpose",
      "subsubtopic": null,
      "content": "Key message: The purpose of the business case practice is to establish mechanisms to judge whether the project is (and remains) desirable, viable, and achievable as a means to support decision-making in its continued investment.\nOrganizations undertake projects to make measurable improvements in one or more aspects of their business. These measurable improvements are called benefits. In cases of compliance or regulatory projects, the benefits may be compared to the consequences of inaction.\nPRINCE2 projects deliver outputs in the form of products which are used to facilitate changes in an organization or for organizations. These changes create capabilities that lead to outcomes. The outcomes allow the organization(s) to realize the benefits that are explained in the business case for the project. Outcomes that are perceived as negative by one or more stakeholders are called dis-benefits.\nFigure 5.1 Relationship between outputs, outcomes, and benefits\nDefinitions:\nOutput The tangible or intangible deliverable of an activity. In PRINCE2, outputs are the specialist products that will be used to enable change.\nCapability The completed set of project outputs required to deliver an outcome.\nOutcome The result of change, normally affecting real-world behaviour and circumstances. Changes are implemented to achieve outcomes, which are achieved as a result of the activities undertaken to facilitate the change.\nBenefit The measurable improvement resulting from an outcome that is perceived as an advantage by the investing organization and contributes towards one or more business objectives.\nDis-benefit The measurable decline resulting from an outcome perceived as negative by the investing organization and which detracts from one or more business objectives.\nBusiness objective The measurable outcomes that demonstrate progress in relation to the organization’s strategy and to which the project should contribute.\nAll projects must have a business justification, usually documented in a business case. The business case establishes not only the reason for the project but also confirms whether the project is:\n● desirable (the balance of costs, benefits, and risks)\n● viable (able to deliver the products)\n● achievable (whether use of the products is likely to result in envisaged outcomes and resulting benefits).\nBusiness justification is not only about costs but also about understanding the value of a project. It is the perceived benefits or importance of the outcomes in proportion to the resources deployed to achieve them. Moreover, business justification is about selecting an approach that offers the best overall value.\nIt is a PRINCE2 principle that a project must ensure continued business justification. This requires that the business justification is established at the beginning of the project through the creation of a business case and then kept under regular review and updated in response to the decisions and events that might impact the desirability, viability, or achievability of the project. If the business justification ceases to be valid, the project should be stopped or changed.\nScenario: desirable, viable, but not achievable (NowByou example: project board asked sponsor to redefine project scope because proposed communication vehicles deemed unlikely to reach intended audience, making outcomes unachievable.)"
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.2 Guidance for effective business case management",
      "subsubtopic": "5.2.1 Business case lifecycle",
      "content": "The business case is developed as an outline at the start of a project based on information provided in the project mandate. It needs to include sufficient information to enable the project board to confirm the business justification and authorize the project manager to initiate the project. PRINCE2 uses the term ‘outline business case’ for this initial justification. Other approaches may use terms such as ‘strategic outline case’. The outline business case is documented in the project brief.\nIn most cases, the project costs, timescales, products, risks, and targets will not be sufficiently understood at this point to provide a robust justification of the entire project. Therefore, the outline business case will need further development and refinement. As the project is planned in more detail and information becomes clearer, the outline business case is developed into a more detailed business case. PRINCE2 uses the term ‘full business case’ to describe this enhanced business case. Other approaches may also use the terms ‘detailed business case’ or ‘final business case’.\nFigure 5.2 Evolution of the business case\nThe business case may also undergo further refinement as the project progresses across stages as actual costs are incurred, forecast benefits are potentially achieved, and information is further understood.\nScenario: business case lifecycle (Findef example: early market testing feedback requires investment committee approval for additional funding due to scope uncertainty.)"
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.2 Guidance for effective business case management",
      "subsubtopic": "5.2.2 Aligning products to business objectives and tolerances",
      "content": "The theory of the links between outputs, outcomes, and benefits is straightforward. However, putting theory into practice is often much more difficult. Many organizations will be able to identify projects that have produced products that were never fully used or organizational changes that were never fully embedded. For benefits to be realized, the outcomes must be achieved, which means that the outputs from the project are used as intended, new capability is defined, and barriers to the use of the new capability are identified.\nA problem that commonly occurs is that projects are often successful from a delivery perspective but fail from an investment perspective. As the project’s outcomes and benefits are often only realized after the project has closed, it is easy for project teams to become focused solely on creating products (the outputs). The link from the project’s outputs to outcomes and benefits needs to be clearly identified and made visible to those involved in the project. Otherwise, there is a danger that the original purpose of the project can get lost, and the benefits will not be realized. Some products are enablers for other products to generate benefits.\nUltimately, the outcomes and benefits to be achieved from the project need to align with and contribute to the business objectives. These may include environmental, social and governance (ESG) goals set by the organization. The sustainability performance targets and tolerances for the project, documented in the business case, should reference and contribute to the ESG goals of the organization (see section 5.4.4 for more information on sustainability).\nThe benefits management approach that supports the business case includes the amount and timing of benefits forecast to be achieved by the project and additional guidance relating to the tolerance against these targets (such as a 10–15 percent increase in sales). Forecast benefits are checked through the project (at a minimum at the end of every stage), and if they fall outside of set tolerances, they should be escalated to the appropriate level for review and action. Ensuring benefits are measurable also ensures that they can be demonstrated. If the project includes benefits that cannot be measured, it is impossible to determine whether it has been a success or provided value for money."
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.2 Guidance for effective business case management",
      "subsubtopic": "5.2.3 Establishing business justification",
      "content": "All seven aspects of the project’s performance targets (see 1.4) and their relationships with each other should be considered as part of assessing the business justification, but there will often be trade-offs between different performance aspects. For example, if in developing the project product description it is decided that higher quality targets are required, it is likely to impact the cost, time, or sustainability targets.\nThe business case considers options to achieve the required outcomes (PRINCE2 refers to these outcomes as the ‘business options’) and selects the option that gives the best balance between the different performance aspects. If a project cannot build a business case within the tolerances set for all seven performance aspects, then its justification may be questionable.\nThe business case should include not only the costs of developing the project product but also any changes to operational costs when the project concludes. Most organizations have policies that define how these costs should be considered in their business cases.\nDis-benefits are expected consequences of an activity, whereas a risk is uncertain and may never materialize. For example, a decision to merge two elements of an organization into a new site may have benefits (such as better joint working), costs (such as expanding one of the two sites), and dis-benefits (such as limited public transport options to the new site). Dis-benefits need to be valued and incorporated into the investment appraisal."
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.3 Techniques",
      "subsubtopic": "5.3.1 PRINCE2 technique for business case management",
      "content": "PRINCE2 includes a four-step business case management technique (develop, check, maintain, confirm) as shown in figure 5.3. An alternative procedure can be used in its place if desired, for example, if the business has already developed a procedure specific to their organization. The use of an alternative procedure should be documented as part of the tailoring decisions in the project initiation documentation.\nThe business case is developed in outline and then in detail at the beginning of the project. It is reviewed and updated as it develops and evolves throughout the life of the project (see figure 5.2). It is checked by the project board at each key decision point (such as at stage boundaries) and confirmed throughout the period that benefits accrue.\nFigure 5.3 Business case through the project lifecycle\nIn figure 5.3 above:\n● develop means to explore options and get the right information upon which investment appraisal decisions can be made\n● check means to assess whether the project is (still) worthwhile\n● maintain means to keep the business case updated with actual progress and current forecasts (including forecast benefits)\n● confirm means to assess whether the intended benefits have been (or will be) realized. Confirming benefits will mostly take place after the project has been closed, although benefits may be realized during the project when products are delivered and released iteratively.\n5.3.1.1 Develop\nThe provision of a project mandate activates the process of starting up a project. The project mandate is then used as an input to develop the initial business justification for the project documented in the outline business case as part of the project brief. In the process of directing a project, the project brief is approved by the project board when authorizing the project initiation. The outline business case is refined into a full business case during the process of initiating a project. The project board approves this when authorizing the project.\nThere are three basic business options concerning any investment:\n● do nothing differently\n● do the minimum\n● do more than the minimum.\nThe ‘do nothing differently’ option should always be the first option and act as the basis for quantifying the other options. The difference between do nothing differently, do the minimum, or do more than the minimum is the benefit that the investment will buy.\nThe analysis of each option provides the project board and the project’s stakeholders with sufficient information to determine which option presents the best value for the organization. It answers the question: for this level of investment, are the expected benefits more desirable, viable, and achievable than the other available options? See 5.3.2.1 Investment Appraisal techniques for a summary of some of the ways in which options can be evaluated and compared.\nDuring the early stages of a project, there may be a wide range of options under consideration, and subsequently, the number of options will be reduced so that they can be examined in more detail. It is important for all projects including those classified as ‘must do’ (such as regulatory projects) to explore different options and select the most appropriate. There may be different approaches available that must be evaluated in terms of their viability, desirability, and achievability.\nScenario: do nothing/minimum/something options appraisal (NowByou example: 'do more than the minimum' option is preferred due to attractive value for money.)\n5.3.1.2 Check\nThe business case for the chosen option should be continually assessed for desirability, viability, and achievability, as any new risks or changes might justify switching to another option.\nThe business case may undergo further refinement and will be updated across stages as project costs, timescale, products, and risks are further understood. Continued business justification drives all decision-making by ensuring that the business objectives and benefits being sought can continue to be realized. As a minimum, the project board should check the business case:\n● at the end of the process of starting up a project to authorize project initiation\n● at the end of the process of initiating a project to authorize the project\n● at the end of each stage to authorize the next stage and the continuation of the project\n● when assessing an exception plan to authorize the revised stage and continuation of the project.\nThe project manager will also check the business case:\n● when assessing progress, risks, and issues to determine their impact on the business justification\n● during the final stage, as part of closing a project, to assess the project’s performance against requirements and the probability that the outcomes will provide the expected benefits\n● when consulting with stakeholders to determine whether any goals have changed (such as whether any additional sustainability objectives have been established by the business).\nThere are many ways to check the expected benefits. For example, sensitivity analysis can be used to determine whether the business case is heavily dependent on a specific benefit. If it is, this may affect project planning, monitoring and control activities, and risk management, as steps would need to be taken to protect that specific benefit.\n5.3.1.3 Maintain\nAt the end of each stage, the project manager updates the business case with the progress data (such as products delivered, projects costs, benefits realized) and the latest forecasted benefits and performance targets. It is important to maintain the business case with appropriate version control so that previous versions can be accessed for reference and comparison.\n5.3.1.4 Confirm\nThe business will review the business case as part of a post-project benefits review to determine the project outcomes in realizing their benefits. They will also assess whether the intended benefits have been realized in practice. During the project, benefits reviews should be conducted at stage boundaries to confirm that any benefits forecast to be achieved during the project are on track to be realized.\nAs shown in figure 5.1 (see section 5.1), projects deliver outputs, and the use of those outputs will result in outcomes that provide benefits to the business. It is important that the project management team understands the benefits and outcomes the project should realize. Otherwise, it is unlikely to be able to develop the right outputs or build and sustain commitment to the changes during the project’s lifespan.\nThe senior user, who is responsible for specifying the benefits from the project, is also accountable for confirming that the forecast benefits are realized. This may involve a commitment beyond the life of the project, as it is likely that many benefits will not be realized until after the project has closed. For this reason, it is usually advisable that the senior user comes from an area of the business impacted by the change. However, this poses a dilemma because when the project closes, the ‘temporary organization’ is disbanded along with the framework (and in particular the funding and resources) to perform any measurement activities.\nThe benefits management approach defines the management actions that will be established to ensure that the project’s outcomes are achieved and to confirm that the project’s benefits are realized. It is first created by the project manager in the ‘initiating a project’ process during the initiation stage and is submitted to the project board for approval when seeking project authorization. If the business is to manage or participate in the benefits reviews, the project board may need to seek its approval. The benefits management approach may be managed by the project or by the business and is likely to be managed beyond the life of the project.\nAny benefits that can be measured during the life of a project should be confirmed by the senior user for formal reporting by the project manager in the end stage reports and end project report. When benefits can be reviewed during the life of the project, the benefits management approach should include appropriate mid-project benefits reviews. Any forecast benefits that are unrealized should be re-examined and their forecasts updated as part of the ‘managing a stage boundary’ process.\nPost-project benefits reviews will involve the business holding the senior user accountable by asking for evidence of how the individual benefits allocated to them have been realized, with corrective actions taken to achieve benefits that have not been fully realized. The post-project benefits reviews will also review the performance of the project product in operational use and identify whether there have been any side effects (beneficial or adverse) that may provide useful lessons for other projects.\nThe project executive is responsible for ensuring that benefits reviews are planned and executed. For post-project measurement activities, the responsibility for benefits reviews transfers from the project executive to the business (specifically the senior user) when the project closes, as the reviews will need to be funded and resourced."
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.3 Techniques",
      "subsubtopic": "5.3.2 Supporting techniques",
      "content": "5.3.2.1 Investment appraisal\nAn investment appraisal compares the costs of developing, operating, and maintaining the project product with the value of the benefits over a period of time. The investment appraisal looks at the relationship between benefits, costs, and risks. It should cover both the project costs (both in producing the required products and the project management costs) and the ongoing operations and maintenance costs.\nThere are many investment appraisal techniques available to organizations that will often have preferences on which technique to adopt for specific projects. The selection of techniques may be influenced by the type of business (such as those that have to follow public sector accounting rules) or the organization’s own standards.\nExamples of investment appraisal techniques include the following:\n● Whole life costs analysing the total cost of implementation and any incremental transitional, operational, and maintenance costs\n● Net benefits analysing the total value of the benefits minus the cost of implementation, transition, and ongoing operation, calculated over a defined period\n● Return on investment (ROI) profits or savings resulting from investments expressed as a percentage of the initial investment\n● Payback a measure of time to remunerate the investment of cash and other resources\n● Net present value (NPV) an amount of money that the investment will have earned by a particular point in time that considers the time value of money using a discount rate to determine discounted cash flows (For example, if the discount rate is six percent, the value of money halves approximately every 12 years. Therefore, if a project is forecasting a £500,000 benefit to materialize in year 12, then it is only worth £250,000 in today’s money.)\n● Internal rate of return a percentage that indicates the rate of return on investment when the NPV is zero\n● Options analysis a comparison of the options by scoring each option against weighted assessment criteria to help identify a preferred option (Pairwise comparison can also be used to differentiate between options to establish the shortlist and preferred option.)\n● Sensitivity analysis adjusting the input factors to model the point at which the output factors no longer justify the investment.\n● For example, a project might be worthwhile if it can be done in four months but ceases to be worthwhile if it was to take six months.\n● Business cases are based on uncertain forecasts. To identify how robust the business case is, it is useful to understand the relationship between input factors (such as project costs, timescale, quality, scope, and project risks) and output factors (such as operations and maintenance costs, business benefits, and business risks).\n5.3.2.2 Multi-case model\nEvaluating investments from different perspectives, rather than focusing solely on financial return, gives a rounded view of whether an investment is desirable, viable, and achievable. Examples of some different investment perspectives include:\n● Strategic perspective understanding the drivers for change and demonstrating how the investment provides strategic fit\n● Economic perspective identifying the option that delivers best value, including wider social, environmental, and sustainability considerations\n● Financial perspective assessing affordability, funding, budgeting, and cashflow over the life of the project and project product\n● Implementation and commercial perspective showing that the preferred option can be delivered by service providers and that robust arrangements are established for successful project delivery.\nFor an investment to be robust, it should be able to demonstrate that it satisfies all these perspectives. The business may have developed its own set of cases for developing business cases, such as an environmental case, and policies regarding their use.\n5.3.2.3 Best, expected, and worst-case scenarios for benefits\nWhen using iterative-incremental approach, such as agile, the scope of the project is typically flexible in order to embrace adaptability and to reassure the project will be completed in the fixed time and budget. Therefore, benefits should be expressed not as a target estimate but rather in the form of a range, relating to the amount of scope delivered.\nOne way to present the estimation of the benefits is to present different scenarios for the scope and the benefits in a business case, for example:\n● best-case scenario describing benefits expected when all (must-, should-, and could-have) requirements are delivered\n● expected-case scenario describing benefits expected when must-have and should-have requirements are delivered\n● worst-case scenario describing benefits expected when only must-have requirements are delivered.\nThe worst-case scenario showing the lowest expectation of the amount of scope delivered should also show that the project is still viable."
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE",
      "subtopic": "5.4 Applying the practice",
      "subsubtopic": "5.4.1 Organizational context",
      "content": "A project needs to align its approach to developing and maintaining the business case with wider business policies, standards, and approaches. These will often differ according to the type of organization, for example, those in the public sector compared to the private sector.\nIf the project is part of a programme, the programme will typically define the approach to business case development and provide an outline business case for the project. The project’s business case will usually be aggregated into the overall programme business case, and its content is likely to be reduced.\nIt may only be composed of the details of the scope, budget and timescales, a list of benefits (and the benefits tolerance), sustainability targets (and sustainability tolerance), a statement of what the project contributes to the programme outcomes, and reasons for selecting the proposed option. The other justification aspects of the project business case should be in the programme business case.\nBenefits will usually be defined, tracked, and managed by the programme management team, and the project’s benefits management approach may be part of the programme’s benefits realization plan."
    },
    {
      "topic": "CHAPTER 5 BUSINESS CASE"}
    ]
}